[
  {
    "signs": ["Aries", "Aries"],
    "love": "An Aries person entertains a free-willed personality. When two Aries are in a relationship, they tend to create for themselves a space in which they can breathe easy; in the absence of doubts to choke them. An Aries, as a lover, is very loyal and wants the other person to trust that loyal-ness of them. In an Aries-Aries love match, both individuals are ruled by the planet Mars. This sameness allows them to easily understand each other and their wanting for the independent kind of love. Hence, in a nutshell, an Aries and Aries couple is better at forging a long-term balanced kind of love.",
    "love-rating": "74%",
    "friendship": "If not a lover, it's highly possible that you might find a friend in Aries. So what is Aries and Aries friendship compatibility like? Well, if we have to define it in a word, it would be - competitive. The Aries, as we have mentioned, is very ambitious and headstrong about their goals. These people usually can't see anyone else taking the front seat in their presence. Thus competitiveness, even in a relationship, is inevitable. However, when the Aries is not busy competing, you would find them indulging in mutual interests. You can trust the Aries and Aries couple to stand by each other when no one else would.",
    "friendship-rating": "82%"
  },
  {
    "signs": ["Aries", "Taurus"],
    "love": "The Aries sign in astrology is ruled by the planet Mars and Taurus, on the other hand, is ruled by the planet Venus. Being the first sign, Aries people are naturally dominating in nature. On the other hand, Taurus, called the bulls of the zodiac jungle, are very stubborn ones who don't like to be controlled whatsoever. Thus, the two signs, Aries and Taurus, are rarely compatible with each other. The association of a Taurus man and Aries woman, or vice versa, could only operate if the two work very hard to find their passage towards a successful relationship.",
    "love-rating": "65%",
    "friendship": "Aries, though, juggle around being an extrovert and an introvert, a Taurus is a stringent introvert. It is simply very difficult for the two signs to develop a likeness for each other in the first place. However, the bond of friendship, when churned between the Taurus and Aries, is a sign of balance. While the Taurus, using their calmness, could help Aries control their wilderness, meanwhile Aries, on the other hand, could infuse a degree of impulse and adventure into the lives of Taurus. The feminine Taurus and the masculine Aries create a good equilibrium for each other thus enriching the Aries and Taurus compatibility.",
    "friendship-rating": "40%"
  },
  {
    "signs": ["Aries", "Gemini"],
    "love": "Gemini and Aries are both optimistic signs and tend to look for the positives when coping with any situation. This kind of trait works very much in the favour of Gemini-Aries love compatibility. These both signs also enjoy excellent communication and deep understanding of one another. When Gemini feels that their partner is being to controlling or if they act too flirtatious towards, both the parties tend to open up about their honest opinions which makes the other fall deeper in love for the other. Together they can make all kinds of new discoveries that they might have missed alone. When a Gemini-Aries couple comes together in a love affair, they connect on a physical as well as an intellectual level. Such a love-compatibility inflames their desire to court and commit to each other for a longer time.",
    "love-rating": "86%",
    "friendship": "In terms of Gemini and Aries friendship compatibility, they are matched to have an incredibly dynamic friendship that seems to run on rocket fuel. An Arian loves to try new and creative things which helps it appreciate a Gemini's unique ideas and implement them. In turn, Geminis are extremely motivating and tend to egg Aries on towards glory. The Gemini-Aries friendship can also take adventurous turns as Gemini is all for activity, no matter how insane it is. This helps the Arian feel liberated. The only pitfall to this aspect of Gemini-Aries compatibility is the lack of trust and clear communication. The patronees of Aries aren't too big on communicating a clear cut manner. Arians can also be extremely passionate and sometimes jealous which could stifle some of Gemini's spirit.",
    "friendship-rating": "70%"
  },
  {
    "signs": ["Aries", "Cancer"],
    "love": "The Cancer sign individuals, as per astrology, are said to be very caring. These people are very family-oriented and are attracted to their domestic environment. Also, Cancerians are very sensitive beings and can get a bit (read - 'a lot') extra possessive at times. Meanwhile, the Aries sign is said to be the controlling ones; who enjoy the luck of immense courage. The outgoing nature of Aries and the shyness of Gemini rarely match, and even if it does, the Cancerian in the relationship might find themselves being controlled by the Aries. The two signs have many dissimilarities but if they work to understand each other, these differences won't be an issue and brew a Aries and Cancer compatibility.",
    "love-rating": "44%",
    "friendship": "The friendship between the Aries and the Cancer is the union of opposites. However, that is not a bad thing especially, if the Aries is male and Cancer a female. The Aries is usually very attracted towards the sensitivity of the Cancer and gets protective of them. Aries in astrology is ruled by Mars and Cancer by the Moon. Aries owns an honest nature and expresses their emotions expressively, which is something that Cancer admires. The Aries and Cancer sign also makes a great match when it comes to trusting each other as they can do it effortlessly.",
    "friendship-rating": "90%"
  },
  {
    "signs": ["Aries", "Leo"],
    "love": "Aries and Leo together are extremely compatible signs as per astrology. The two signs share a great understanding and are eternally ready to complement each other across domains with love being no exception. Aries in astrology is represented by the animal Ram that makes this sign highly social in their approach. Meanwhile, Leo is represented by Lion, which makes these people passionate and independent. And then the fact these qualities exist in coexistence, thus the Aries and Leo signs understand each other's emotional state perfectly and thus make a very compatible couple.",
    "love-rating": "89%",
    "friendship": "Aries is ruled by the planet Mars and Leo, by the planet Sun. And for facts, both Mars and Sun are masculine energies. Thus, Leo and Aries are able to comprehend each other well. Also, talking about Aries and Leo compatibility in friendship, both these signs are Fire signs. The fire element within makes both the signs wanna be a leader, but there is no competition between the two until the knot of friendship is intact. However, the dent in Leo and Aries' friendship could be the result of Aries' impulsive nature to jump onto things and Leo's unrelenting attitude, which could frustrate Aries.",
    "friendship-rating": "81%"
  },
  {
    "signs": ["Aries", "Virgo"],
    "love": "The Virgo is an earth sign, while Aries, on the other hand, is the fire sign of the zodiac jungle. The fusion of the two can either be a source of warmth or could simply burn down the whole forest and there is nothing in between. So simply say, if Aries and Virgo are together, it comes down to what the two make of their relationship with time and understanding. Aries is charismatic and passionate, whereas Virgo is graceful and a perfectionist. These qualities, when combined, can only be a source of all the fine things in the world. However, making this happen would need a lot of effort from both of you.",
    "love-rating": "70%",
    "friendship": "Well, though not in love, but in friendship, the Aries and Virgo sign may find for themselves a mutual ground. The Aries is ruled by the planet Mars and Virgo is ruled by Mercury. An Aries is like a soldier who likes to dash, however, without much planning. Meanwhile, the Virgo is a tactician who likes to evaluate all their actions. Thus, the two can learn a lot from each other. With time and effort, they could learn to work together and merge their good qualities.",
    "friendship-rating": "62%"
  },
  {
    "signs": ["Aries", "Libra"],
    "love": "Aries is the Fire sign of the zodiac, while on the other hand, Libra is the Air sign. Aries and Libra make a very compatible pair, but not without certain caution. Air, when controlled, keeps the Fire burning. This means, giving each other space and respect to grow is of utmost importance for Aries and Libra compatibility. Aries and Libra usually find an ethereal pull and attraction towards each other. However, a breach into another's space is not welcomed as it could lead to the dozing of the fire. Moreover, despite the prevailing attraction, the passive-aggressive behaviour, especially from the side of the Aries usually stops these two from seeing each other.",
    "love-rating": "80%",
    "friendship": "Aries, as per astrology, is ruled by the planet Mars, the symbol of masculinity, and Libra, on the other hand, is ruled by the planet Venus, the symbol of femininity. Thus an Aries and Libra compatibility in friendship is obvious as the two signs represent a balance of energy. Both Libra and Aries are said to be the starters of things, however, they tend to work in different directions. This means, the Aries and Libra friendship may not find the 'friends forever' tag, but till the time they are together, they will create unforgettable moments for themselves. One truly remarkable feat about this union is the harmony they create.",
    "friendship-rating": "86%"
  },
  {
    "signs": ["Aries", "Scorpio"],
    "love": "Aries, being the first zodiac sign, is said to be very courageous, ambitious and one who is ready to take risks in life. And similarly, the Scorpio personality is passionate, patient and understanding. While the kinda similar traits make many think that Aries and Scorpio make a great couple, but in reality, these similarities become the source of clashes. While the Scorpio likes patience, the Aries' hurrying attitude is not something the Scorpio likes or would want to be a part of. However, if Aries and Scorpio can combine their energy towards a solo goal, the fusion is beneficial. Honesty is of utmost importance for the signs with the Scorpio needing constant attention. Scorpio also doesn't like anyone playing with their pride thus if you two seek to co-exist, it is best to not hurt the Scorpio ego and take things easy.",
    "love-rating": "82%",
    "friendship": "Both Scorpio and Aries are ruled by the planet Mars in astrology. The energies of two Mars natives could lead them to either become allies or ruthless enemies. Arguments in friendship are inevitable but the differences won't exist for long. Aries, as they like to be the starters of things, claims the spotlight in the Aries and Scorpio relationship, meanwhile, the Scorpio stays behind the scenes to support the Aries intellectually and emotionally. Aries and Scorpio could have a wonderful friendship and achieve great success while having their share of fun.",
    "friendship-rating": "69%"
  },
  {
    "signs": ["Aries", "Sagittarius"],
    "love": "Aries people are very confident and ambitious who possess leadership qualities. Meanwhile, Sagittarius is known for their extroverted, dynamic, social and friendly attitude. The fire and fire compatibility infuses a very deep level of understanding between these two signs forging an excellent Aries and Sagittarius compatibility. Aries and Sagittarius' relationship, though slow in the initial stages, picks up pace as Aries reveals their free spirit and steadfast individuality, and Sagittarius their powerful persona and consistent confidence. Though very competitive by nature but when these signs are together, they only work to better each other. Keep Aries and Sagittarius in a room and they would have a lot to share and better each other.",
    "love-rating": "96%",
    "friendship": "Both Sagittarius and Aries are fire signs who have a knack for adventure. They are both enthusiastic and optimistic, and comprehend each other well and thus not only make a great couple but great friends too. In astrology, Aries is ruled by Mars, which represents initiatives and Sagittarius by Jupiter, the planet which represents indulgence and aspirations. Therefore, this makes the Aries a starter of things, the one who pulls out the best ideas from the kitty and inspires the Sagittarius to eagerly support them (indulgence).",
    "friendship-rating": "92%"
  },
  {
    "signs": ["Aries", "Capricorn"],
    "love": "Capricorn is an Earth sign while Aries, a Fire sign. And if you ever wish to see people who are poles apart, then Aries and Capricorn could be the showpiece you could glare at. Capricorn is the owner of a calm attitude while Aries, on the other hand, is very outgoing in nature. Though in a way, Aries and Capricorn are two linked signs, but they don't realise it due to the difference in their characters. What could possibly make the Aries and Capricorn relationship work is the belief they have in each other. The two signs are very loyal in approach thus are able to create a full-fledged trustable bond when together. Also, as these two signs are very goal-oriented, you can expect them to support each other on the professional front too.",
    "love-rating": "78%",
    "friendship": "The ruling planet of the Aries is Mars and Capricorn is Saturn. In astrology, the planets Mars and Saturn do not share a good bond, which is something that reflects in Aries and Capricorn compatibility in friendship. An Aries Capricorn friendship seeks constant attention from both ends. However, once the physical contact succumbs, it gets very difficult to continue with the friendship. Nevertheless, the best thing about the Aries and Capricorn is the uniqueness they bring in the partnership. As long as either of them is allowed to preserve their identity, their alliance works well.",
    "friendship-rating": "43%"
  },
  {
    "signs": ["Aries", "Aquarius"],
    "love": "Here comes your knight in shining armour Aries. Apart from the initial A, there are literally thousands of other things that take the Aries and Aquarius compatibility beyond imagination. The Aries are usually attracted to the Aquarius owing to the latter's charming personality. The Aries and Aquarius are very idealistic individuals and extremely good at communicating their thoughts and feelings with each other. In love, the Aquarius are a bit reserved but open and excited about learning the hows and wows of the relationship. These two signs usually go well together in general and they support each other through thick and thin.",
    "love-rating": "86%",
    "friendship": "The ruling planet of Aries is Mars, and the ruling planet of Aquarius is Saturn. Saturn is the planet of creativity that bestows Aquarius with the luck of imaginative vision. Meanwhile, Mars, as the starter of things, helps in putting plans into motion. Moreover, the Aquarius also brings the trait of perseverance in a relationship, which inspires the two to keep working hard. So collectively, the Aquarius and Aries compatibility on friendship brews fruitful consequences for both natives. These signs ideally suit each other, but they also value their individuality, thus may not agree with each other in various instances.",
    "friendship-rating": "87%"
  },
  {
    "signs": ["Aries", "Pisces"],
    "love": "Two signs who find it difficult to find a common ground are Aries and Pisces. While the Aries are kinda bold and outgoing, Pisces is known to be very shy and sweet. While the zodiac chart begins with one, meanwhile it ends with the other. So the poles apart are quite visible in theory. But despite this, the Pisces and Aries compatibility shall brew. The Aries goes headstrong into every situation and the Pisces, on the other hand, is fond of expecting the unexpected. The risk-taking skills of both the signs help them balance each other. Moreover, as the Aries and Pisces are neighbours, the fire sign Aries leverages the spot and always protects the gentle Pisces, which is an act that builds trust between the two signs.",
    "love-rating": "88%",
    "friendship": "The Aries sign in astrology is ruled by the planet Mars while, on the other hand, Pisces is ruled by the planet Jupiter. The influence of Mars keeps the Aries strong and active. Jupiter's influence adds intensity to their friendship. Aries could help Pisces realise their dreams, and on the other hand, Pisces could provide a recess where Aries could display the softer side of their character. In a nutshell, both the signs complement each other well in a relationship. And as they do so, the chances of their friendship turning into something special are always high.",
    "friendship-rating": "75%"
  },
  {
    "signs": ["Taurus", "Taurus"],
    "love": "Mutuality Alert! When we speak of compatibility between a Taurus and Taurus couple, there is no end to the list of mutual things they share. Thus, when two signs like them get along, it is a connection of a lifetime. They shall spoil each other with immense pampering, gifts, charms, and whatnot. But, with such perfect blissfulness, Taurus-Taurus love can slightly have possessiveness and jealousy mixed in it. So, a feeling of being spied might surround them around the opposite sex. With one of the most growth-giving relationships, Taurus and Taurus love compatibility has no bounds if they realize that their bonding is too good to imperil with small arguments.",
    "love-rating": "91%",
    "friendship": "With a long-lasting one, Taurus-Taurus friendship is deep and one of the most stable ones. The two shall seek understated easement with the other one, which both can come to trust on. Both of them also invest equally in their friendship which eventually takes their friendship compatibility to another level. Taurus and Taurus friends have immense trust and kindred spirit amongst them. They share a similar viewpoint on life, and in an easy-peasy way, trust their Taurus mate in no time. Thus, Taurus and Taurus friendship compatibility is more or less like chicken soup for each other's soul.",
    "friendship-rating": "94%"
  },
  {
    "signs": ["Taurus", "Gemini"],
    "love": "When Taurus and Gemini come together in a love affair, they must both take the time to learn what the dynamics of the relationship are and how they can best get along. This is because, when it comes to matters of the heart, they both have their own unique preferences on how to express them. The sign of the bull is more grounded and prefers to express its affection in the form of physical acts whereas, Gemini being an air sign, lives out its love life with a more abstract concept of romance. Moreover, Taurus may want too much for Gemini's taste early in the relationship, but Gemini can become dependable and steady — Taurus must simply be patient. These differences in Gemini-Taurus love compatibility could lead to a bit of misunderstanding and would require quite a lot of emotional management to make the Gemini-Taurus relationship a success.",
    "love-rating": "80%",
    "friendship": "Taurus is a very practical creature and has a different approach to live as compared to the whimsical Gemini. This could bode ill for Gemini-Taurus friendship compatibility. Taurus doesn't like to take risks, while Gemini loves exploring new horizons. The Bull craves security, while the Twins yearn for variety. Therefore, when a bond of friendship between these two signs does blossom, it is usually centred around some mutual interests. However, both these signs harbour an immense passion for their hobbies and so the Gemini-Taurus friendship will glow when they undertake similar tasks with respect to these common hobbies. When they are in this phase, Taurus appreciates Gemini's brilliant insights, while Gemini admires Taurus' great taste.",
    "friendship-rating": "60%"
  },
  {
    "signs": ["Taurus", "Cancer"],
    "love": "When Taurus and Cancer are zodiacs close together in a loveable relationship, they depict an endless flux of love because of sharing deep Karmic ties. Where Taurus is the ineradicable type, Cancer nurtures everything emotionally. In the Taurus-Cancer love match, the former will love to mitigate in a way that makes sense, while the latter would sometimes respond in a sulking manner to their partner. A Taurus and Cancer couple will be like “Peaceful Warriors” as it is earthy Venus and calm Moon getting together, making it a secure and comfortable duo and a blissful Taurus and Cancer love compatibility. They shall never get into intense fights but may try to deal with each other with emotional blackmailing.",
    "love-rating": "79%",
    "friendship": "Friends with ever helping benefits? Yes! That's what they are, Just like Hermoine and Harry! Where one gets stuck, and the other comes up with a solution almost every time. None of them is fearful or less initiator and share a beautiful array of mutual interests. Thus, Taurus and Cancer friendship compatibility is exceptional and admirable in all. With being so clear cut throat to each other, Taurus-Cancer friendship is so great that they can get along with each other in no time effortlessly. When the Crab bears self-doubts, the strong Bull pops in at the right time with motivation. On the other hand, when the Taurus searches for new accessions, their Cancer friend bursts in with kosher bargains.",
    "friendship-rating": "92%"
  },
  {
    "signs": ["Taurus", "Leo"],
    "love": "Both Leo and Taurus are characterized by their strong determination and their ability to make difficult decisions and stick to them. While Leo is loaded with passion, Taurus on the other hand is deeply emotional. When these two signs come together they might experience problems and dissimilarities between them at the outset. However, as they start spending more time together, they come to realize how much they enjoy each other's company as well. While a Leo might find the Taurus lacking in passion and outward romance, he/she will attention and care instead. For the Taurus, the Leo might seem overbearing at times but he/she will certainly make things much more dynamic and interesting. Leo and Taurus compatibility flourishes when both signs can get over their fixations in their personalities and instead focus more on what Leo and Taurus love has to offer to each other.",
    "love-rating": "54%",
    "friendship": "Taurus and Leo are both fixed signs which makes them incredibly difficult to work with. In terms of Leo and Taurus friendship compatibility, one can only watch them from a distance as they never back down from what they want. They are extremely stubborn and often fails to recognize the needs of the other. Nevertheless, Leo and Taurus friends can share a common thing which is trust. This is the one thing that they both value and can become the pillar of their successful friendship. Leo-Taurus friendship is mostly of mutual respect than a mutual love for each other which does not say a lot about their friendship. They can become competitive against each other and often in a negative manner.",
    "friendship-rating": "30%"
  },
  {
    "signs": ["Taurus", "Virgo"],
    "love": "With innate practicality and immense love, Taurus and Virgo love compatibility is an intense one. Both these zodiac signs exert viability in their day-to-day lifestyle as the most orderly means to majority issues. They could be pretty devoted and sincere towards each other and have a substantial deal of integrity. Where Taurus appreciates their Virgin Virgo's wisdom, the Virgo partner adores the Bull strength of their Taurus half. Taurus-Virgo love shares enormous mutuality. With both being materialistic in nature, they also work hard for each other's comforts and enjoy an off-chaotic love life. Taurus, on one side, analyzes a lot, and Virgo, on the other hand, criticizes a lot. In short, compatibility between them turns out awesome if they both run on the same page. Otherwise, it shall not take long for a Kaboom!",
    "love-rating": "84%",
    "friendship": "Taurus and Virgo friendship compatibility can be long-lasting and intense, as both of them are somewhat similar. Even though the Bull-headed Taurus does not admit this fact at times and the Hard nut Virgo criticizes too much, they put high stakes on stability and help to identify valuable qualities in each other. As both the natives believe in being organized, practical, and rational in nature, they usually make the other one focus on their ideal aims in lost times. The Taurus-Virgo friendship is full of kindness and honesty. Also, they shall never be dishonourable with each other even in the crankiest times. Thus, consider them as one of the most compatible friendship duos.",
    "friendship-rating": "93%"
  },
  {
    "signs": ["Taurus", "Libra"],
    "love": "They love to be in love but with each other? Hard-match! Taurus-Libra love compatibility is, thus, a so-so one as both Venusians do know the meaning of love but find it hard to seek in each other. Considering Taurus, it is sensual and down-to-earth love, while for Libra, it is a high and moral love. Thus, a Taurus and Libra couple is less likely an “Ideal Match” and more of a “Versus Match.” On one side, both are foodies, love romanticism, and appreciate the luxuries around and with them. While on the other hand, unrealistic expectations regarding each other make them clash more often. It is a sensual Bull meeting an Intellectual scale making the odds feel all uneasy between them.",
    "love-rating": "37%",
    "friendship": "Taurus and Libra friends are like two total opposites put together. Despite both ruled by the same planet, they differ so much in numerous ways. Where the Taurus is a silent and salient folk, their Libra friend would be a blabbermouth. The former would use their senses to run things, and the latter would guide themselves with their logic. Taurus and Libra friendship compatibility is more of an N-N or S-S pole made to hang out together, forever repelling and giving anti-viewpoints! Away from their behavioural differences, they still enjoy having meals together at fine dining, all luxury they can possess, and all sorts of art forms. Plus, discussing the glams, gleams and music can become a way of the two getting along in the same way.",
    "friendship-rating": "60%"
  },
  {
    "signs": ["Taurus", "Scorpio"],
    "love": "The two signs are highly possessive as they merge their lives so wholly with their loved ones. A Taurus and Scorpio couple has a persona that passes as a fixed and self-contained sign of rooting in. Yes, a deep material and emotional reliability desire are shared between the two. And so, the Bull and the Scorpion wish to have a soulful and deep love that becomes their Forever! Taurus and Scorpio love compatibility is potentially solid as they both help each other grow and involves immense trust with mutual goals. The Venus native Taurus and the Mars native Scorpio make sparks fly with their bonding and togetherness. Thus, a Taurus-Scorpio couple holds all the aces when with each other.",
    "love-rating": "83%",
    "friendship": "In terms of friendship, both the signs have a natural affinity towards each other. Being like the North and the South Pole, they attract each other in all possible manners and have a curiosity to know the other one better. And so, their dispensed outlook makes them hang out together. Taurus and Scorpio friends agree on several things and value many priorities and characteristics. There may be some disharmony between them when their behaviour clashes. Where Taurus likes to be courteous, Scorpios become assertive and straightforward. But, as they balance each other’s energy, Taurus and Scorpio friendship compatibility is a win-win for both of them.",
    "friendship-rating": "85%"
  },
  {
    "signs": ["Taurus", "Sagittarius"],
    "love": "The couple with awestruck chemistry? Yes, here they are. The Taurus and Sagittarius couple are the rightful example of a bold relationship. The two zodiacs are superbly passionate about each other and enjoy mostly a long-term romance. Unless zeal gets them to balance, they seek each other as some oddly in mood partners. You can adore Taurus and Sagittarius love compatibility with their spark during the initial interaction. Though their lust for living life freely and to-all puts up some messes. But when it comes to commitment, both seek to be high on spirits and experimental regarding outlooks. Taurus-Sagittarius love can thus be a mixture of deep intimacy and easy-going lovey-dovey socialness.",
    "love-rating": "70%",
    "friendship": "Taurus and Sagittarius friends could be hefty of a task. The two vary in their needs, wants, and everything else. While the Bull wants to roam in similar exploration areas, the Archer wants to explore the areas that are new and fascinating. The Taurus is possessively passionate, and their pal Sagittarius would hardly care for material goods. So many differences, but then what is mutual that they share? The love for the outdoors. Roaming in snowy mountains or taking walks in the garden, any trip can make them budding buddies in just minutes. Thus, Taurus Sagittarius friendship compatibility is admirable if they are flexible roaming the world with each other.",
    "friendship-rating": "67%"
  },
  {
    "signs": ["Taurus", "Capricorn"],
    "love": "The Taurus and Capricorn couple could get into a bonding that shall be a sophisticated and sensible partnership. They both can take a bag and fill themselves up with a list of gains their partners have to offer. By sharing down-to-earth interests and logic, both of them admire each other’s strength, devotion, and dignity as well. Taurus barely likes to calculate and give all-in, even if it is their professional involvement and emotional connection. Their Capricorn half believes that it is a great idea to do so as they are focused mainly on building themselves up professionally. Both of them always try to uplift each other in the places their other half lacks. And thus, Taurus and Capricorn love compatibility may set high standards for other signs only if they help rightfully motivate each other.",
    "love-rating": "71%",
    "friendship": "Their friendship is often bound by their mutual interest in materialism and glitzy life. Taurus-Capricorn friendship can be a rapid one as both of them are reliable and can count on each other in all ways. Also, their hilarious sides make them take their discussions in a healthy manner. While the Bull assists the Crazy Goat to get dedicated towards work, the organized Goat helps the Bull-head become managed and organized. Furthermore, both the folks are true traditionalists and enjoy the time they spent together to its fullest. So, holding a pleasant bond, the Taurus-Capricorn friendship compatibility is strong plus loyal.",
    "friendship-rating": "81%"
  },
  {
    "signs": ["Taurus", "Aquarius"],
    "love": "For Taurus-Aquarius love to last, there would be several sacrifices. Taurus shall need to shift their focus from traditionalism towards experimentation. Aquarius, on the other hand, shall have to give away their cravings for self-freedom. When working together, Taurus and Aquarius love compatibility can show positive vibes. Only when Taurus and Aquarius couple foreplays, rightfully, they could create an admirable balance and be a unique pair. The Taurean folk must become a well-grounded “doer,” while their Aquarian half must stay a dreamy bee. In other words, they need to set boundaries for themselves as well as for each other. But like oil and water, they too have pretty few chances of meeting each other's love expectations.",
    "love-rating": "28%",
    "friendship": "Taurus and Aquarius friends don't have much of common topics to speak about as they are entirely different zones people. Taurus cares a lot about things and constantly wishes for attention, validation, and affection, while Aquarius can't stop thinking about what others think of them. Both of them badly desire to be distinctive. Taurus and Aquarius friendship compatibility might be a fragile one. Aquarians would search for an intellectual friend while the Taureans crave an emotional one. Moreover, they would hardly be interested in communicating with each other because of their self-esteem matters and cold and harshness towards each other.",
    "friendship-rating": "24%"
  },
  {
    "signs": ["Taurus", "Pisces"],
    "love": "Both zodiacs are all about adoring pleasure and building up an emotional and stable love relationship. The major obstacle Taurus-Pisces love faces is when they fail to reach other's body language and create fuzziness between them. Other than that, they would find it incredibly easy to fall in love with each other and share a beautiful and strong bond. As a couple, they would be best cuddle buddies for each other, and every touch of their partner would make them feel special. Being next to each other would be their ideal time. Thus, Taurus and Pisces love compatibility is high and a wonderful one.",
    "love-rating": "88%",
    "friendship": "Taurus-Pisces friendship is with a lot of flows and ebbs. The Bull stands in its place firmly while making decisions, while the Fish is like swimming all around, losing all the patience they have and asking esoteric questions. Taurus would think that Pisces is foolish or loose-headed and fails to understand how they can believe in “Living in the Moment.” Pisces folks would appreciate Taurus attempt of making them understand the elements of reality. Moreover, they would consider it as a big thing in their friendship. Thus, Taurus and Pisces friendship compatibility works best when they deal with each other with perseverance and patience.",
    "friendship-rating": "75%"
  },
  {
    "signs": ["Gemini", "Gemini"],
    "love": "When two Geminis partner off, it really is like four people coming together (Gemini is represented by the Twins). Gemini is all about freedom and variety of expression, and two Geminis together will enjoy this to the fullest. Others enjoy two Geminis as a couple as well — they're sure to be the life of every party with their sharp wit and well-honed entertainment routine. If they can avoid competition and cooperate instead, their love relationship can be extremely happy and mutually satisfying. The way in which their romantic similarities align, without rubbing off against each other is what makes the Gemini-Gemini love compatibility so successful. When two Geminis have a crush on each other, there's a mirrored twinkle in the eyes. At first, it can seem like a nervous frenzy of speed dating. Gemini-Gemini couples in love are whirls of activity, playful, and nervous. With the mercurial personalities of Gemini, the pace is quickened, and it can leave both of them breathless and totally exhausted.",
    "love-rating": "80%",
    "friendship": "The biggest advantage of a Gemini-Gemini friendship is that they have a lot of chances of becoming best friends. They have a knack for spotting each other from across a crowded room. Both the people are of social nature and would end up being the centre of the attention at parties with their antics. That is why they enjoy the company of other Twins. Masters of trivia, these two friends swap facts and anecdotes the way kids trade baseball cards. When these two get bored of one another, they'll easily part ways but then come together later, when they have more stories to share. There is always so much complementarity in this duo Gemini friendship that there is no space for jealousy in this bond.",
    "friendship-rating": "95%"
  },
  {
    "signs": ["Gemini", "Cancer"],
    "love": "When Gemini and Cancer come together in a love affair, it may be a rather curious relationship. Cancer is the sign of home and hearth, while Gemini is the thinker which is a good match when discussing Gemini-Cancer love compatibility. Gemini can easily slip into the role of Cancer's knight in shining armour; Cancer returns that favour with their characteristic urge to protect the ones they love. Quality of home life is important to Cancer, and Gemini will be spoiled by their Cancer lover's hearty home cooking, soft bed and other creature comforts. If Gemini just reassures Cancer that they're loved and cherished, all will go smoothly for the Gemini-Cancer couple.",
    "love-rating": "88%",
    "friendship": "Friendship between the Deer and the Crab doesn't come naturally, but it can be very rewarding. Gemini is highly intellectual, while Cancer is extremely emotional. The two friends have radically different reactions to life, which is a good thing. Gemini can help Cancer realize that while feelings are important, they can be controlled. Cancer will show Gemini the value in forming lasting, heartfelt relationships. The Twins don't understand the Moon Child's obsession with economic stability. Conversely, Cancer doesn't get why Gemini can't sit still for two minutes. Mostly, they laugh at each other's quirks. Gemini and Cancer do not run in the same circles. They often find each other because of a mutual friend. The Cancer-Gemini pair can form a lifelong relationship that provides them both with the support they need.",
    "friendship-rating": "84%"
  },
  {
    "signs": ["Gemini", "Leo"],
    "love": "When Gemini and Leo come together in a love affair, their relationship is playful and high-spirited, characterized by light activity and optimism. Gemini thrives on mental stimulation and is therefore very attracted to Leo's creative, dramatic spirit. There can be trouble between the Gemini-Leo romantic couple, however. If Leo takes Gemini's flirty, outgoing nature too seriously, or if Gemini thinks Leo wants to maintain total control of the relationship, arguments may break out. Though their approaches are different — Gemini likes to analyse things from all points of view in an intellectual conversation while Leo would rather not talk about it and just jump right in — they are well-matched. These small kinks in the Gemini-Leo love compatibility can be smoothened out as their bond progresses.",
    "love-rating": "84%",
    "friendship": "Effusive and affectionate, Gemini and Leo form a fast friendship. This Leo-Gemini friendship can be formed over a mutual admiration of society that is positively addictive. Gemini and Leos really play off each other's strengths. Both signs are outgoing and love to be around others, so they get along famously as friends. Leos use their confidence and leadership to help Geminis move forward with plans when they are indecisive, and Geminis use their intelligence to prevent Leos from carrying out risky ideas they haven't thought through enough. This makes the Gemini-Leo friendship compatibility highly organic. Gemini is quick to appreciate Leo's style, creative talent, and warmth. Leo loves laughing at Gemini's witty remarks. These two are very adventurous and enjoy getting into trouble together. Fortunately, Gemini is an expert at talking their way out of punishments. This is the one instance when Leo should follow their friend's lead.",
    "friendship-rating": "71%"
  },
  {
    "signs": ["Gemini", "Virgo"],
    "love": "When Gemini and Virgo come together in a love affair, it's crucial to the survival of the relationship that they take time to learn about one another's approach to life and love — and remember that both partners' attitudes are worth understanding. For Virgo and Gemini love compatibility to work, both need to understand that they are mutually different people, and that should not be considered as a threat to their equation. If both the parties accept that they cannot and should not change their partner, their bond has a chance of surviving the odds. Virgo may be a bit too serious and demanding for Gemini, especially if this occurs early in the relationship before Gemini has fully committed. If Virgo just gives it time, things will smooth out.",
    "love-rating": "55%",
    "friendship": "Although Gemini is an Air Sign and Virgo belongs to the Earth, these friends do have lots in common. Both signs are ruled by the planet Mercury, conferring high intelligence. The Gemini-Virgo pals love sharing book, film, and music recommendations. These two signs make decisions based on what is logical instead of blindly following their hearts which bodes extremely well for the Gemini-Virgo friendship compatibility. They rely on common sense more than their guts. These signs tend to get along well in the workplace because they are both good at listening and observing. They love to learn and want to do the best job possible. They also collaborate very well. Gemini prefers to generate ideas, while Virgo is great at implementing them. While these signs get along on the surface level, a deep friendship between them is uncommon. Virgos are very selective about the people they allow into their inner circle. Meanwhile, Geminis are going to feel like Virgos are trying to ruin all of their fun. They are going to clash in more lighthearted, social environments, like parties.",
    "friendship-rating": "32%"
  },
  {
    "signs": ["Gemini", "Libra"],
    "love": "On paper, these two astrological signs have many distinctive differences. They tend to desire completely contrast things in life and really need to put in considerable effort to make their relationship tick. In a Gemini-libra love affair, they enjoy a great relationship based on intellectual interests and mental agility. Dual-natured Gemini loves Libra's balance, and Libra is always entertained by the chatty, brainy Twins. Libra loves art and beauty while Gemini loves the beauty of an idea, but these loves aren't far off from one another. The Libra and Gemini relationship has the potential to bring about much happiness. For one, Libra can give Gemini so much understanding. Even though they have a difficult time getting a grip on Gemini because of their unpredictable ways, Libra will always try to remain logical and rational with them. They never fail to amaze Gemini with their patience and consideration, no matter how many times Gemini pushes them to their limit.",
    "love-rating": "89%",
    "friendship": "Gemini and Libra are boon companions that adore one another. As soon as these two get together, they are laughing and exchanging ideas. They love making plans together but rarely stick to the planned-out program. This Gemini-Libra friendship can be quite indecisive and adventurous as these two Air signs seem to bring both the worst and the best in each other. Both of these friends are very knowledgeable, so they enjoy talking about anything, from politics to gossips about celebrities. However, they may take hours to decide what movie to watch because Libra is pretty indecisive and impartial. It would be better for Gemini-Libra friendship compatibility if they just flip a coin or close their eyes and to choose the first thing coming to their mind.",
    "friendship-rating": "94%"
  },
  {
    "signs": ["Gemini", "Scorpio"],
    "love": "Where Gemini is adaptable, intellectual, outgoing and chatty, Scorpio tends to be secretive, focused, intense and determined. Gemini tends to take things lightly, including their lover; Scorpio, on the other hand, has a very deep need for emotional connection and intimacy. Scorpio is generally very loyal to their lover and very connected to the relationship. In a Gemini-Scorpio relationship, they'll need to learn to understand and accept one another's differences — and if they can, they will be a nearly unbreakable couple. A Scorpio will trust their partner deeply, but when the partner appears to be flaky or disrespectful, that trust can be quickly broken. A Gemini's flirty and playful nature can easily trigger jealousy and distrust. f one falls in love first, and that feeling is not reciprocated, then it can be hard for them to synchronize and the relationship may be over before it begins.",
    "love-rating": "10%",
    "friendship": "When it comes to Gemini-Scorpio friendship compatibility, each have their own ideas about how life should be conducted. Neither can be easily converted. That's why it can be difficult for these signs to form a friendship. The Gemini-Scorpio companionship is full of energy and intensity so the likelihood of great adventures but also conflict is rather big. The friendship between the Gemini and the Scorpio may be based on the different ideas these two natives have, regarding how life should be lived. The Gemini is very knowledgeable and always talks about facts when being involved in a debate. The Scorpio is never afraid to go beyond limits and to discuss any taboo subject. Scorpio isn't afraid to shatter taboos and challenge limiting attitudes. Independent Gemini finds Scorpio's jealousy distasteful, while passionate Scorpio can't comprehend Gemini's composure. They do appreciate each other's keen intellects.",
    "friendship-rating": "29%"
  },
  {
    "signs": ["Gemini", "Sagittarius"],
    "love": "Gemini is quite able to provide pioneering, adventurous Sagittarius with the independence Sagittarius requires in a close relationship, because Gemini shares that same need. A Gemini-Sagittarius love relationship can be truly spectacular! These two are extremely compatible; any rough spots they encounter during the course of the relationship are sure to be smoothed over with a minimum of effort. A Gemini-Sagittarius couple can have a passionate love relationship where they quickly fall for each other, but a long-lasting love affair may require some extra work. Sagittarius enjoys exotic lovers from different cultures drawing their interest in a much wider net than Gemini. Both signs can be passionate when the relationship is new and adventure-filled, but both can also quickly lose interest and become bored.",
    "love-rating": "94%",
    "friendship": "The friendship compatibility between a Gemini-Sagittarius duo is very unique and exciting. Gemini likes fiction while Sagittarius prefers biographies. The Twins want to hear all the gory details while the Archer is only interested in the big picture. Gemini can see many sides of a given issue, while Sagittarius insists there is only one truth. The Gemini-Sagittarius friendship also seems quite a magnificent combination despite the few stormy moments that they encounter sometimes. These difficulties can be overcome with little effort. The Gemini-Sagittarius friendship can either be flexible or reach extremes. However, both the signs are highly adaptive in each other's vicinity. When Sagittarius suddenly wants an extraordinary journey, Gemini will be really quick to jump in the car and follow.",
    "friendship-rating": "98%"
  },
  {
    "signs": ["Gemini", "Capricorn"],
    "love": "When Gemini and Capricorn come together in a compatible love affair, it may be tough for them to remember why they're together at all, as the ways in which they approach the world couldn't be more opposite. If they're operating from a base of love and mutual respect, they'll be able to overcome most obstacles, but they must work hard. Gemini must have the freedom to think outside the bounds; they rely on their quick wits, humour and intellectual prowess to move through life at a fast pace. Capricorn is concerned with advancement and status; they rely on following the rules and finding set, tried-and-true paths to follow toward success, no matter how long it takes. Gemini likes to cut corners; Capricorn likes to be thorough. Thus, the Gemini-Capricorn duo faces challenge as a couple is to learn to maintain a similar pace so they can arrive at the same place at the same time.",
    "love-rating": "20%",
    "friendship": "In terms of friendship compatibility between the Gemini - Capricorn duo, both of them will have to look hard for any shared activities to bond over. Gemini likes fiction while Sagittarius prefers biographies. The Twins want to hear all the gory details while the Archer is only interested in the big picture. Gemini can see many sides of a given issue, while Sagittarius insists there is only one truth. Although these two signs come at life from radically different directions, they can still form a solid friendship. They both love to travel. A shared love of the written word is another bond. In addition, these two are great students. Their friendship is a miniature classroom.",
    "friendship-rating": "59%"
  },
  {
    "signs": ["Gemini", "Aquarius"],
    "love": "Gemini is in love with ideas, and visionary Aquarius is full of them. Both of these Signs need their independence; they can easily provide this for one another since they understand the need so well. In a Gemini-Aquarius love affair, the pair can enjoy a wonderfully stimulating mental connection. Flexibility is something that is advantageous in the Gemini-Aquarius love compatibility. Anything goes for both of them. They can reinvent and experiment with everything. There is no taboo for them. Their flaws and inconsistencies are not even that much of an issue. Furthermore, both always share deep conversations with each other. Almost all of the time, they share the same interests and viewpoints. And to some extent, both even have the same opinions on things, and may even finish each other's sentences. Aquarius and Gemini share an excellent logical rapport with each other.",
    "love-rating": "72%",
    "friendship": "The Gemini-Aquarius duo has an instant affinity for each other. Curious Gemini loves hearing about Aquarius's latest theories. Aloof Aquarius admires Gemini's ability to make friends with people from all walks of life. A successful Gemini-Aquarius friendship compatibility features a strong bond between two people who share a good psychological association with each other. Gemini loves innovative ideas and is attracted to Aquarius' vision. Both partners relish their freedom. Disagreements could occur in their friendship if Aquarius take a dislike to Gemini's frivolous nature, or Gemini feels that Aquarius are too obstinate. Aquarius would try hard to attain their shared ambition, and Gemini would do everything to support them. The partners just need to combine their efforts and direct them to fruitful purposes, and they could accomplish almost anything. Gemini and Aquarius friends love attending parties together, separating once they arrive and then coming together to exchange notes afterwards. At times, the Twins will groan about the Water Bearer's stubborn attitude. At others, Aquarius will sigh impatiently over Gemini's inability to follow through with promises. In the end, they'll set these criticisms aside and enjoy each other's company.",
    "friendship-rating": "89%"
  },
  {
    "signs": ["Gemini", "Pisces"],
    "love": "When Gemini and Pisces come together in a love affair, they can make a very empathetic and mutually satisfying couple and this will boost their love compatibility. Gemini is cerebral, quick-witted and silver-tongued, and can bring a dash of humour and intellectual direction to help focus Pisces's dreamy view of the world. Pisces has the gift of intuitive empathy; they connect very well with others on a rather subtle emotional level, and their dreamy nature makes them quite open-minded — in short, Pisces expects the unexpected. Gemini is open-minded as well; mentally both agile and flexible, the Twins are gifted at seeing all sides of an issue and at communicating with other people. This relationship is all about flexibility and connection.",
    "love-rating": "38%",
    "friendship": "Gemini and Pisces understand each other well and form a strong friendship. Pisces are imaginative and sensitive, and Gemini must be careful not to hurt their feelings. However, any arguments they have are easily forgotten, and they rarely bear ill will towards each other. Gemini and Pisces are two totally different people who have lots to teach each other. Gemini is great at shaking off disappointment and finding fresh opportunities. Pisces is adept at forming meaningful relationships that last a lifetime. If the Twins can endure Pisces's emotional rollercoaster and the Fish can put up with Gemini's neuroses, these two can be good friends. Gemini is impressed with Pisces's creative talent, while Pisces thinks Gemini is as smart as a whip. They're both versatile and can make allowances for each other's shortcomings.",
    "friendship-rating": "54%"
  },
  {
    "signs": ["Cancer", "Cancer"],
    "love": "When two Cancerians come together in a love affair, a loving and yet very emotional domestic relationship ensues. A Cancer-Cancer match makes for a deeply devoted duo, endlessly loyal to one another. Both will learn the ins and outs of their partner, the best ways to heat each other up or, if necessary, to cool one another down. Both will also find great comfort and satisfaction in their underlying commitment to one another. Cancer in love is reticent, insecure and finally wholly absorbed. With a love match, each will try to show the other that they're home base—a safe zone in a world of meanies and players. Once trust is established, they'll enjoy going out, but also spend a lot of time at home, the start of lifelong nesting. Intimacy is sweet and sensual and bonds their hearts like superglue.",
    "love-rating": "89%",
    "friendship": "Cancer has uncanny instincts about people. That's why they attract each other like magnets. Both share a weird sense of humour that few others understand. When two Moon Children get together, they start laughing like lunatics. The duo Cancerians understand one another's rhythm - they don't subscribe to pop psychology and the notion that every moment must be spent being happy. Before meeting each may have felt there was something wrong with themselves - for not being deliriously joyful all the time - that's what makes the friendship special - like souls who believe in a range of emotions - including sentimentality and sadness. They both know how to make money and hold on to it. As a result, they often use their friendship as a launching pad to a successful business. At times, their extreme mood swings can cause them to snip at each other.",
    "friendship-rating": "56%"
  },
  {
    "signs": ["Cancer", "Leo"],
    "love": "Both Leo and Cancer require dedication and affectionate care, which makes Leo and Cancer compatibility great. But while Cancer desires solidity and emotional concord, Leo covets earnest compliments along with sincere admiration. They are intensely loyal, to the point that Leo and Cancer love is defined by possessiveness. Cancer, being the sensuous one, longs for safety in their relationship while Leo needs it for their self-confidence. A Leo and Cancer couple is also committed to each other in an enduring, gratifying union. Being similar in their desires, they might help each other fill a void in each other. When talking about Leo-Cancer love, both longs for a closely-knit family as well. Leo brings flair and passion to this family, and Cancer brings sensitivity and nurture. Leo plays a bolder role in this relationship whose position is vivid and majestic. Both Signs are also extremely resolute, which is why they must try to be attentive to understand and accept each other.",
    "love-rating": "84%",
    "friendship": "Leo is a sign which is characterized by pride and honour. They love it when their ego is stroked and more often than not, they prefer to be the centre of attention wherever they go. Even when the person is an introvert, Leos generally look for some attention in a social gathering. Cancer, on the other hand, is almost the opposite of Leo in this sense. They love to do things for others and rarely expect anything from others. They are characterized by their caring nature who prefers happiness over pride. Due to these reasons, Leo and Cancer friends can be found to often be reciprocated and uplifting. However, the overzealous nature of Leo can get on the nerves of Cancer at times. Following such circumstances, Leos can easily sway Cancers by showering them with love, failing to do so might end up deteriorating their friendship. Therefore, it can be summed up that Leo and Cancer friendship compatibility can be rated above average.",
    "friendship-rating": "66%"
  },
  {
    "signs": ["Cancer", "Virgo"],
    "love": "In a Cancer-Virgo love match, there exists a strong, down-to-earth relationship with staying power is the happy result. This is a love relationship with great potential to get better and better over the passing years. Both Cancer and Virgo are goal-oriented and disciplined. They are sincere and devoted to one another and share a strong sense of purpose. No lightweight love here: These two were not really built for flings! Cancer and Virgo deeply admire one another: Virgo respects Cancer's quiet strength and dedication while Cancer appreciates Virgo's keen adaptability and intelligence. As this pair joins the heart and mind, the Cancer and Virgo relationship face two outcomes. First, they can end up crashing into one another and banging heads over any debate they have. Or, Cancer and Virgo can bring the mind and heart to work together on tackling any challenge they face. The typical connection allows for the heart and mind to rule in unison. Both parties appreciate the affectionate and loving connection they establish. With compromise and flexibility, Virgo and Cancer find themselves in a lifelong love affair.",
    "love-rating": "66%",
    "friendship": "The Cancer and Virgo signs have a healthy respect for one another. Cancer has solid values, preferring to cultivate relationships with quality people. Virgo has pure principles, refusing to be swayed by offers of money and status. This is a friendship that may take time to develop, but it will get stronger. The Cancer-Virgo pair is based on common sense and strong principles. These friends can be materialistic, as they both enjoy comfort, but they are willing to work hard for the things they enjoy. Difficulties can arise if Virgo is too critical of Cancer's easily bruised feelings; Cancer needs to understand that this is Virgo's nature and not a personal attack. When the Moon Child and Virgin come together, they feel supported. Of course, Cancer can't abide Virgo's nit-picking. Conversely, Virgo will barely tolerate Cancer's emotional outbursts. Eventually, the Moon Child will teach Virgo the value of unconditional love, while Virgo will teach Cancer not to cry over trivial matters.",
    "friendship-rating": "89%"
  },
  {
    "signs": ["Cancer", "Libra"],
    "love": "The Cancer and Libra Signs seek a secure, assured relationship and will enjoy their shared appreciation for beauty and luxury — especially when it comes to their domestic environment. These two can blend their energies harmoniously if they choose to work toward a common goal. Though this pairing may progress more slowly than some others, and at first, they may fear that they have little else in common than their mutual needs for companionship and love of beauty. When Cancer and Libra make a love match, they give to one another important things that each lacks. Cancer can become obsessive about alone time. When Libra is moving from one social circle to another, Cancer senses a waning attraction! The song “Don't You Forget About Me,” is an ugly ear-worm playing in Cancer's head. Meanwhile, limelight loving Libra hears Lady Gage's “I live for the applause!” It's best if the parties in this love affair assume nothing.",
    "love-rating": "24%",
    "friendship": "The Cancer and Libra bond is sweet. But there is a chance it will sour if they aren't careful. While having commonalities empowers this pair, differences threaten to separate them. For one thing, Cancer is a total introvert. They love being at home and raising a family. Like the crab, they prefer the comfort of their shell. If they could, Cancer would carry their home around with them wherever they go. Libra, on the other hand, is a social bug. The Libra personality is the epitome of an extrovert. They love socializing with their huge circle of friends and acquaintances. Cancer is quiet and moody. Libra is outspoken and chipper. In this regard, the parties in the Cancer and Libra friendship are like night and day. Differences, when not embraced by both, end up being a real sore spot in the Cancer and Libra friendship. When Libra wants to talk things out, Cancer is apt to hide true feelings. When Cancer is sulking or in a bad mood, Libra will want to turn that frown upside down. It's easy for Cancer and Libra to irritate one another.",
    "friendship-rating": "20%"
  },
  {
    "signs": ["Cancer", "Scorpio"],
    "love": "When Cancer and Scorpio make a love match, the resulting relationship draws together the energies of two emotionally intense Signs. Signs such as these often combine well, each partner's strengths balancing the other's weaknesses. These Signs feel a strong sexual attraction, and when they are together the temperature in the room tends to rise! Cancer and Scorpio pair have a great deal in common, and much potential to keep their relationship passionate and going strong. Cancer protects the home environment like it's a fortress. They won't let an ounce of negativity enter their home. The home environment is the safe and soft place where Scorpio and Cancer duo can land after a hard day. They block out all the chaos coming from the rest of the world. Scorpio and Cancer love spending time alone and have no problem closing out the real world at the end of the day. In fact, they prefer the alone time a bit too much. They'll need to emerge from their fortress once and a while. It will allow them to offer each other a healthy amount of room for personal growth.",
    "love-rating": "72%",
    "friendship": "Cancer and Scorpio pair just click. Sensitive Cancer understands Scorpio's driving passion. Perceptive Scorpio intuits the Moon Child's desire for happy home life. But there are some sources of strain in this friendship. The Cancer and the Scorpio friends simply get along because the first is emotional and can see the passion of the second. The Scorpio also has a strong intuition and can guess what their Cancer friend wants. These two will have moments of tension because the Cancer can't accept how vengeful the Scorpio can be. In return, the Scorpio will hate seeing the Cancer running away to dwell in their negative feelings. The Scorpion can't stand when Cancer scuttles away to cry. Despite these differences, each will protect the other's interests. Cancer secretly enjoys giving painful pinches to Scorpio's enemies, while Scorpio openly loves avenging the Moon Child's hurt feelings. It's a strong and occasionally intimidating alliance.",
    "friendship-rating": "91%"
  },
  {
    "signs": ["Cancer", "Sagittarius"],
    "love": "When Cancer and Sagittarius make a love match, they both need to be patient and give the relationship time to grow and mature. As it develops, each love partner will discover that they have much to offer one another. At first, it just seems like Sagittarius is the thrill-seeker who enjoys the occasional adrenaline rush, and that Cancer derives much more satisfaction from emotional security. Sagittarius needs room to grow and roam. As the mother archetype takes shape, Cancer is better off as a free-roam Mother. She is one who has confidence in her child to allow them to go off into the world on their own. She doesn't hover over her children watching their every move. It's this access to the world Cancer will need to give Sagittarius. It's the only way to make their partner comfortable in the relationship. Sagittarius doesn't like to answer to anyone. With Jupiter as their ruling planet, they crave expansion and growth. Cancer focuses on making the home a fortress for their love. Sagittarius is looking to wander. It becomes a parent-child relationship where Sagittarius rebels against the parent for freedom. If Cancer doesn't learn to let go, there can be a lot of growing pains along the way!",
    "love-rating": "9%",
    "friendship": "Cancer and Sagittarius are a strange duo. The sensitive Crab can burst into tears at the drop of a hat, while the optimistic Archer refuses to let anyone break their stride. Cancer is great at creating a comfortable, enriching home life, while Sagittarius prefers living out of a suitcase. Their friendship alliance is truly strong and scary. After all, both are passionate, intense and generous with their feelings because there aren't two other signs to enjoy such good compatibility between themselves. When a Scorpio and a Cancer are friends, new levels of deepness get to be revealed to both of them. They can collaborate very well because they're balancing each other positive and negative traits. Furthermore, these two like one another very much and can combine their dreams and strategies into successful projects. They have many things in common, so their connection can be very strong.",
    "friendship-rating": "16%"
  },
  {
    "signs": ["Cancer", "Capricorn"],
    "love": "Capricorn, the Sea-Goat, is focused on logic, on being down-to-earth and real; Cancer brings a charge of emotional intensity to the relationship. Both hold one another to high standards tempered by abiding mutual respect. When Cancer and Capricorn make a love match, it's a celestial pairing of great tenacity and determination. Some pairings might even work through ancestral traumas carried in their genetic coding. When Cancer and Capricorn affair first meets, they feel a deep kinship. Something inside of them tells this duo they belong together. If they don't hook up on a romantic level, at least they are lifelong friends. They feel a sense of “coming home” or as if they've found a lost aspect of themselves. The emotional bond runs deep. They enjoy spending time with one another but require freedom. It will help avoid co-dependent behaviours from taking root.",
    "love-rating": "74%",
    "friendship": "Cancer and Capricorn friends are complete opposites, which is the secret to their friendship. The Crab has tremendous emotional intelligence, knowing what people need to thrive. The Goat is enormously practical, understanding what needs to be done to succeed. The friendship between the Cancer and the Capricorn is defined by two natives who have a lot of determination and the power to be assertive. The Capricorn is rational and composed, whereas the Cancer brings in all the emotions in the friendship. Both of them expect great things from their friends, but they can calm one another down when they're best pals. The Cancer appreciates how the Capricorn is dedicated, while the latter likes the former for being tenacious. Their connection is sure to last and to be secure. Cancer is cardinal and belongs to the Water element, not to mention he or she is ruled by the Moon. When making friends with someone, people in this sign want stability, to offer their care, love and protection.",
    "friendship-rating": "89%"
  },
  {
    "signs": ["Cancer", "Aquarius"],
    "love": "When Cancer and Aquarius make a love match, it can be a case of opposites attracting. Cancer takes an emotional approach to life, Aquarius, an offbeat, unconventional approach. While Cancer often retreats into its shell, Aquarius takes every opportunity to be the extrovert, the organizer and party animal. They love to find themselves amongst friends; social settings are simply their thing! If a Cancer and an Aquarius can find a way to combine these qualities in a positive way, they can go anywhere together. Aquarius personas tend to be honest, in a brutal sense. It is not due to a non-caring attitude. Rather, it is their light-hearted approach to life. The Aquarian personality sees no reason to be so serious. This can make the Cancer personality wonder if the Aquarius partner will ever be serious. So how can this combination ever work? Cancer needs to take a breath and calm their inner emotional storms. If the relationship is to work, it will come together of its own accord. No forcing the issue will make it happen. Patience is the key to the Cancer personality. Acceptance of Cancer's emotional mentality will make things easier on Aquarius. If they achieve a balance, it increases Aquarius and Cancer compatibility.",
    "love-rating": "49%",
    "friendship": "Cancer and Aquarius duo are a pair of odd ducks. The Moon Child has an offbeat sense of humour, while the Water Bearer has an unorthodox view of life. They might view each other as weirdoes, which is often the launching pad to their friendship. Cancer looks to the past for their values and beliefs whilst Aquarius rockets ship ahead to the future, playing with Parallel universes and Robot implants. At times, both can get a tad fanatical - Cancer may dabble in fundamentalist religion whilst Aquarius embraces Anarchy and discarding of old conventions - extremism drives a temporary wedge in their friendship - or lands one of them in prison. When they inevitably come back - moderating their beliefs - the friendship is resumed. These signs admire each other's intelligence - opinions are researched - sometimes they are swayed a little by thoroughly articulated evidence",
    "friendship-rating": "24%"
  },
  {
    "signs": ["Cancer", "Pisces"],
    "love": "A Cancer and Pisces love match is a positive meeting of spirits. Both signs are basically tolerant and sympathetic, and Pisces is easily energized by Cancer's ideas. A Pisces mate can open a Cancer's eyes to the world of creativity and spirituality. In turn, Cancer's practicality can be a guide, leading Pisces to the fruition of their dreamy, utopian ideas. This celestial pairing benefits from an amazingly strong and multifaceted emotional bond. This love is so fierce it will defy any emotional turmoil. Once the chaos subsides, they are either making angry love or crying. When crying, they are begging each other for forgiveness. It's true their tempers put a hamper on the tender side, but let's all be thankful anger is a passing emotion. Let's also be thankful the love they establish makes them the forgiving kind. It's a good thing visits to the dark side of their natures remain rare. This connection is lasting due to the empathy and compassion each party has for one another. The heart-to-heart connection makes the Pisces and Cancer love match a power couple!",
    "love-rating": "86%",
    "friendship": "Cancer and Pisces duo are great pals. Loving Cancer enjoys lavishing insecure Pisces with affection. The expressive Fish adores drawing the Crab out of its shell. There will be times when Cancer gets exasperated with Pisces's irresponsible behaviour with money. Cancer/Pisces have a strong sense of community and believe in helping societies' most vulnerable members. They express this belief by volunteering in animal shelters, soup kitchens and anywhere community support is required - it's this platform that often creates enduring friendship. Alternatively, they are likely to work in health or social serves and become close through sharing similar personal philosophies although not necessarily methodology - Cancer is conventional and old school when it comes to medical and physiological practices whereas Pisces comes to the relationship armed with crystals, runes and Shaman training.",
    "friendship-rating": "72%"
  },
  {
    "signs": ["Leo", "Leo"],
    "love": "Leos are just as majestic as their sign animal, lion. As the king of the jungle, they roar of pride and magnificence. When two such majestic creatures come together to form a bond, they command the attention of all the people around them. It is almost as if a spectacle has been put up by two gregarious individuals who deserve each other. A Leo and Leo couple enjoys the strong spirit of each other. As they find themselves drunk in the passion of each other, they also do not shy away from revealing their desires for each other. The splendour of a Leo-Leo love is apparent from the enthusiasm which they share among each other, each contributing as much as the other. This strong relationship truly speaks volumes of Leo and Leo compatibility. Both of them, no matter how introverted they are, is capable of socializing and therefore establishing their relationship among their social circles with ease. And when things get difficult, they can feed off of each other's confidence. However, despite the grandeur of Leo and Leo love, they can find themselves offsetting at times. Leos are a self-centred bunch who can offer a lot of passion and love for their partners so long as their ego is fed which begs the question of whose life revolves around who in this relationship. This can prove to be quite strenuous for both Leos.",
    "love-rating": "69%",
    "friendship": "As proud as they are, Leos can be extremely friendly among their loved ones. Therefore Leo and Leo friendship compatibility is comparatively better than what one might expect. Leos are characterized by their passion and strong conviction of success and confidence. In a Leo-Leo friendship, this conviction is often useful to each other as they can regain their confidence from the other's conviction. Leos are also terrific when it comes to trust. In most cases, Leos can readily sacrifice themselves for their friendship. However, this act rarely comes from a place of deep love and affection. Rather, it comes from their conviction of a perfect friendship that they have in their minds. They are also bad liars which can make them difficult in situations where a white lie might come in handy. All in all, Leo and Leo friendship compatibility is great as long as mistrust does not creep in due to external factors. Their ego is too inflated to confront one another and their inability to lie does not help either.",
    "friendship-rating": "74%"
  },
  {
    "signs": ["Leo", "Virgo"],
    "love": "Generally, Leo and Virgo do not go very well in terms of building a relationship. When it comes to Leo and Virgo compatibility, the fire sign Leo is too proud and often conceited for the likes of the earthy Virgo. On the flip side, the romantic Virgo might be too wishy-washy for the taste of the passionate Leo. At the outset, Leo and Virgo will inevitably struggle in finding a common ground. This relationship evolves gradually as the partners become understanding and appreciating. Leo is extroverted, dominant, and charismatic, and sometimes features, what can be considered a short fuse. Virgo is studious and withdrawn and possesses more versatility than Leo. Although there are differences, Leo and Virgo couple creates an exquisite marriage when each partner warms up to the other's unfamiliar style. At times, Leo could seem tyrannical, and Virgo could seem too judgmental. But once they stop looking solely at one another's flaws and start to get one another's positive attributes, they'll discover an attraction.",
    "love-rating": "49%",
    "friendship": "When it comes to friendship, Leo and Virgo can be great assets to each other. Leo often radiates confidence which is something that the insecure Virgo can feed off of. On the other hand, Leo often lacks order and stability which the Virgo can offer. Virgo also offers intellectual prowess to the arrogant Leo which can be tremendous in bringing Leo to the right track. Leo offers fun and spontaneity that's often missing in Virgo's life. Virgo teaches Leo patience and enables him/her to set their intellect in order. However, Leo and Virgo friends might repel each other at times. This often happens when Leo's overbearing nature of constantly wanting to be in the spotlight disrupts Virgo's haven when it is absolutely necessary for Virgo. Leo and Virgo friendship compatibility, therefore, boils down to Leo's ability to control his/her enthusiasm and be wary of the surrounding.",
    "friendship-rating": "63%"
  },
  {
    "signs": ["Leo", "Libra"],
    "love": "In a Leo and Libra couple, there is always a congenial amalgamation. Being placed just two signs apart in the Zodiac, Leo and Libra undergo profound compassion for the inner workings of each other. Lion's abundant vigour combined with Libra's natural sense of harmony is a romance that screams remarkable Leo and Libra compatibility. Leo and Libra demonstrate the outlandish versus reserved, candid versus amiable. In Leo and Libra love, they can revel in an almost effortless relationship. Both are capable of appreciating as well as benefitting from the positive traits of each other. Leo and Libra love can be seen as Libra can calm and pacify Leo's grandiosity. They are also incredibly well balanced. Libra uses charisma and kindness to tame Leo's outspoken and acerbic temperament. Leo, being far more decisive than Libra, can aid Libra in making decisions relatively easily. Leo can also help bring some spontaneity into Libra's life.",
    "love-rating": "86%",
    "friendship": "In a Leo-Libra friendship, the two signs with the elements of fire and air respectively, come together to form the rudimentary groundwork of any relationship, which is warmth and passion. Leo and Libra belong to the Sun and Venus respectively and are extremely fluid when they are together. When Leo and Libra friends come together, they strike a balance between energies because the sun represents masculinity and Venus, femininity. The Sun is capable of revitalizing life and bring cordiality while Venus demonstrates the splendour of romance, thereby nourishing one another throughout their life. In terms of Leo and Libra friendship compatibility, the best part is the harmony resulting from the union of Venus and the Sun. The stability which these two signs offer each other is what's represented by this relationship. This also functions as a phenomenal learning experience for both partners/friends. Each of them makes up for what the other is missing, so there is a mutual benefit from their partnership.",
    "friendship-rating": "91%"
  },
  {
    "signs": ["Leo", "Scorpio"],
    "love": "A Leo and Scorpio couple is usually dynamic when they can pull it off. With opposing elements - fire and water - dictating each other's personalities, Leo and Scorpio compatibility is not exactly impressive. Leo, who is governed by the Sun, yearns for compliments and attention, along with respect. Scorpio, on the other hand, demands not only respect but also Leo's unconditional love. Leo-Scorpio love becomes difficult because they tend to view the world from completely different perspectives. Further, Leo's constant need for compliments can become overbearing for Scorpio while Scorpio's haughty silence can be too much for the burning Leo. Luckily, a Leo and Scorpio love match has hope because both of them can trust each other, despite their differences. They both value loyalty and can even get possessive at times. Leo also tends to be flamboyant which won't be a problem as long as Scorpio feels that they are treated with respect and an equal in the relationship. Even then, Leo's constant search for the limelight can annoy Scorpio their privacy is violated and they are dragged into Leo's love for the spectacle.",
    "love-rating": "44%",
    "friendship": "Rigidity and resilience are the key features in a Leo-Scorpio friendship. Both these signs are extremely opinionated as well. They are defined by their persistence when it comes to working for their goals. Both can readily do anything to find success in their lives. This can be the driving force between Leo and Scorpio friends. If they make plans together and both of them can benefit from it, they'll stick to those plans no matter what. However, as most people might have already figured it out, utilitarian concepts are brittle when it comes to emotional relationships. Although they can benefit from each other hugely, they will eventually fall out due to numerous reasons. One important aspect is that they might not see eye to eye in many things but decide to get along with each other just because they profit from it. Leo might find Scorpio too self-righteous, and even a little smug. On the flip side, Scorpio can find Leo boastful and conceited. Eventually, they might stop getting along altogether since swallowing up pride is something they are not used to. This is what makes Leo and Scorpio friendship compatibility so weak.",
    "friendship-rating": "39%"
  },
  {
    "signs": ["Leo", "Sagittarius"],
    "love": "The spectacle that a Leo and Sagittarius couple can put up in their own, as well as other's lives, can be likened to fireworks. Leo is one of the most energetic signs in the zodiac with fire as its element which further gives them the passion and zeal that they carry over to their relationships. Sagittarius, on the other hand, is the epitome of a free spirit whose element is also fire. Together, they form a dynamic and fun-loving couple who can make all other signs envious of the greatness of the Leo and Sagittarius love compatibility. With both signs' elements being fire, they might experience the occasional impatience and intolerance of each other's grandeur. But, they will also exhibit endurance. Their high energy will almost always be welcome by each other and it is one of the numerous things that fuel a Leo-Sagittarius love life. Further, both Leo and Sagittarius love to be in each other's company because there are not too many people who can bear their high energies all the time. They are also outgoing and charismatic which further allows them to lift the mood in almost any environment.",
    "love-rating": "96%",
    "friendship": "In a Leo-Sagittarius friendship, there is a lot of heat. Both of them share the same element of fire which also means that they share the same masculine energy. However, Sagittarius, being a mutable sign, can transform this heat into warmth. Due to this, Leo and Sagittarius friends can understand each other without having to exchange words. They are fundamentally a good combination who are extremely similar in their personalities. Leo is also ruled by the Sun which ignites passion in the hearts of a Leo and Sagittarius couple as well. This passion can then be explored and heightened by the Jupiter-ruled Sagittarius. Their high energy enables them to be motivated in their work which is a good thing, but sometimes, they can end up overworking themselves. Further, in a Leo and Sagittarius friendship, Sagittarius, being a mutable sign, can offer understanding to the adamant Leo. Leo, in turn, benefits Sagittarius by teaching them to be more charming and impactful. There is a chance that Leo might become overbearing for Sagittarius at times, but they will always remain loyal to each other.",
    "friendship-rating": "84%"
  },
  {
    "signs": ["Leo", "Capricorn"],
    "love": "The most wonderful thing about a Leo and Capricorn relationship is that they have immense love for each other when they get together. The only reason Leo and Cancer get together is because of their overflowing love for one another. The worst thing about a Leo and Scorpio couple is that this love works against their relationship. And before you get confused, let us explain how this happens. The elements of Leo and Capricorn are fire and earth respectively. It is common knowledge that fires blaze suddenly and burns everything around, metaphorically and literally. On the other hand, earth characterizes composure. They take their time to build things up which is completely the opposite of what Leos do and how they are. In a Leo-Scorpio love match, Leo's love is expressed in their emotions which like to engulf their partners suddenly. They expect their partners to succumb to this power. However, Scorpio can't have this. They are quick to neutralize Leo's emotional outbursts of love by slowing things down as soon as Leo fires them up. This can lead to extremely unsatisfying relationships in a Leo and Scorpio love life, despite all the love for each other.",
    "love-rating": "27%",
    "friendship": "Leo is ruled by Sun and is the embodiment of ego and self-worth. They can bring warmth and light into the lives of their loved ones through their fiery passion. A Leo radiates energy and enthusiasm which can make the people near them enthusiastic as well. Capricorn on the other hand is ruled by Saturn which is responsible for accountability and hard work. In a Leo-Capricorn friendship, both signs can learn from the diversity of each other while also being relatable to each other due to their common quality of leadership. Sun and Saturn which represents life and tenacity respectively, can be extremely compatible with each other if they choose to pay close attention to each other making Leo and Capricorn friends better when they are together. Leo and Capricorn friendship compatibility can be considered as decent. For a Leo, freedom is crucial to living their life to the fullest and while Capricorn can go along with it, what they seek in their lives is a steady income and professional stability. A Leo-Capricorn love match, as well as a Leo-Capricorn friendship, represents a balance between romanticism and pragmatism. This makes their friendship reassuring as well as fun. Conflicts can occur between them but if they can get past that, this friendship can benefit both of them.",
    "friendship-rating": "57%"
  },
  {
    "signs": ["Leo", "Aquarius"],
    "love": "Leo and Aquarius love matches embody the amalgamation of Leo's creativity and Aquarius' foresight. Leo, who is energetic, dynamic and zealous, adds flavour to Aquarius' determination, poise and sophistication. A Leo and Aquarius couple is pretty much unstoppable as they can get through any problem using their strengths. They have a strong connection between them and even though their relationship is congenial, they have moments of competitiveness due to their inherent individual competitive nature. The best thing about a Leo-Aquarius love match is that they manage to make even the dullest moments fun when they are together. Leo and Aquarius love compatibility can be considered as one of the best among the zodiacs. Leo's dignity and zeal charm Aquarius while Aquarius' individualism and prudence are admired by Leo. Aquarius' attraction to Leo can be likened to moths being drawn to light. While Aquarius is mesmerized by glamorous things, Leo acts as glamour itself. This makes Leo and Aquarius love extremely strong. Leos can be a handful for Aquarius at times and the latter can be too erratic for Leo as well. However, they will have mutual respect and despite their interdependence in their romantic life, they will have separate independent lives as well, which is crucial for Leos as well Aquarians.",
    "love-rating": "88%",
    "friendship": "Leo and Aquarius friendship compatibility can be considered as adequate, considering that they have the potential to help each other grow and bring different but compatible traits to the table when they get together. Leo is ruled by the Sun, while Aquarius is ruled by Uranus, the god of the sky. Aquarius tends to be slightly eccentric by nature while Leo is extremely flamboyant and passionate. Both signs are deemed equally interesting by each other which helps Leo and Aquarius friends to establish a ground for their friendship from the get-go. Both signs are also equally intelligent which, coupled with their ambitious nature can help them touch the skies. However, both these signs are fixed signs, which is reflected in their adamant personality. Once they put a mind into something, it is unusual for them to back down. When two fixed signs come together, it is not unlikely for problems to occur at times. Nevertheless, Leo and Aquarius breeze through their differences by following their differing interests individually. It is highly unlikely that they force each other into doing what the other wants. When they find a similar interest again, and they will find one, owing to their multitude of interests, they get back together and work in it with the same zeal and creative outlook.",
    "friendship-rating": "89%"
  },
  {
    "signs": ["Leo", "Pisces"],
    "love": "Leo and Pisces love compatibility can be quite ambiguous. While both signs adore the novelty that they bring into each other's lives, they also can't stand each other's affability when it comes to speaking their minds out during bitter moments of their relationship. They are also distinctly dissimilar which adds to the incongruity between them. Leo, with their fire element, is free-spirited and assertive and likes to take command of their surroundings. With water as their element, Pisces on the other hand is considerably reserved, quiet and introspective. Their vivid differences attract one another but Leo-Pisces love matches often end up finding each other mundane after spending some time with each other. Leo and Pisces compatibility is also dependent on the fact that they are both dreamers who can fill the voids that they may carry. Further, in a Leo and Pisces love life, the former can end up acting like a guardian to the quiet Pisces. Although this isn't necessarily bad, it can rile up Pisces as they do not like to be considered weak. The worse thing is, despite their displeasure, Pisces might choose to not speak up which only increases the chances for things to get worse in the future. Contradictorily, Pisces also tends to give themselves to their partner completely. When that happens, the Leo-Pisces relationship will be something to cherish.",
    "love-rating": "46%",
    "friendship": "Leo and Pisces are ruled by the Sun and Neptune respectively. While the Sun represents warmth and passion, Neptune represents deceit and mistrust. Leo is also a fixed sign who has the traits of a king and often brings deceit to its eventual demise. Leo and Pisces friendship compatibility is therefore unimpressive when it comes to the trust that these signs carry for each other. Both signs might seem dishonest to each other at times which is not necessarily the truth. Nevertheless, the mistrust is enough to kill the hopes of a Leo-Pisces friendship. Neptune is also about dreams and illusions. Pisces are individuals who like to live in dreams rather than confront bitter reality. This is something that Leos can't stand. Pisces, on the other hand, dislikes Leo's conceited behaviour. Further, Pisces, although quite agreeable and likes to do almost anything to be likeable, hates working under a boss. Unfortunately, Leos love to boss people around and considers themselves as the leader in any relationship. Leo and Pisces friends, therefore, get apart from each other and Leo-Pisces love matches eventually fall out of love for each other. The only salvation that they have in their friendship, perhaps, is their willingness to do good for the world and society.",
    "friendship-rating": "14%"
  },
  {
    "signs": ["Virgo", "Virgo"],
    "love": "In a Virgo and Virgo couple, the partners are likely to assemble their lives in stunning conjunction. Virgos can be very pragmatic and industrious which is why when they come together, they are able to devote themselves to each other perfectly. People might rarely see Virgo and Virgo love as clingy and obsessed with each other but when the curtains fall, they can be quite doting. The Virgo and Virgo compatibility is further affected by their scepticism and perfectionist nature which can create some conflict between the two. However, their pragmaticism will quickly enable them to resolve those. The Virgo-Virgo love relationship is perfectly capable of being good parents as they can set an example for how parents should be. Being the responsible creatures as they are, they can schedule their day and work to achieve their daily goals without breaking a sweat. It is not an exaggeration to say that a Virgo and Virgo couple is one of the best hands that you can get.",
    "love-rating": "90%",
    "friendship": "In a Virgo-Virgo friendship, there can be a lot of competition. They like to have the best things around them which is why they will push the people near them to their best versions. This can be an extremely important feature among Virgo and Virgo friends. They never settle for anything other than the best. They are also extremely cautious. Even then the Virgo and Virgo friendship compatibility is always excellent because they often take the initiative to find out the best actions not only for themselves but also for their family and friends. The giving nature of a Virgo bodes extremely well for Virgo and Virgo love as well. Couples can be excellent friends as well. When both Virgos often readily sacrifice themselves for the betterment of the other, conflict rarely occurs. They are more concerned about their connection than their pride. Virgos are also almost always true to their words which make them incredibly reliable as well.",
    "friendship-rating": "98%"
  },
  {
    "signs": ["Virgo", "Libra"],
    "love": "Coordination is key in a Virgo and Libra love match. The earth sign Virgo is highly pragmatic and orderly. Their engines run on hard work and strategic planning of their daily tasks. Complacency has no space for them. On the other hand, the air sign Libra is extremely balanced in their personality. They are even-tempered and impartial to all things. This makes Virgo and Libra love compatibility quite magnificent when it comes to understanding each other on an emotional level. Despite being a couple that almost feels like two pieces of puzzles coming together, a Virgo and Libra couple can come across numerous problems. For one, Virgo can be extremely critical of their partners at times which often does not bode well for Libra. Criticism is something that Libra finds difficult to digest, especially when too much is thrown at them too often.",
    "love-rating": "41%",
    "friendship": "Virgo and Libra communication compatibility is a daring topic to discuss since there aren't too many nice things to say other than the ones already mentioned in the previous sections. Restating the only caveat in a Virgo-Libra friendship, Virgo's unwillingness to open up can make communication quite a bit tricky when it is related to Virgo and Libra love as well. Further, despite being the initiator, Libras are extremely indecisive. They like to consider every side of the story very carefully before deciding on anything. On the other hand, Virgos can be relatively stubborn and decisive. This creates a huge communication gap when they are trying to sort out their feelings for each other. A Virgo and Libra couple might often find themselves arguing as Libra is mostly willing to understand their differences at first but as Virgo keeps criticizing their tentativeness, things can get quite unpleasant.",
    "friendship-rating": "50%"
  },
  {
    "signs": ["Virgo", "Scorpio"],
    "love": "One can say that when Virgo and Scorpio come together in a Virgo-Scorpio love match, the universe starts to pay close attention. Virgo and Scorpio are earth and water signs respectively. They can both oppose and complement each other simultaneously. The Virgo and Scorpio compatibility might not seem to be strong at first glance. However, they both value loyalty and mutual respect which is the key element in a Virgo and Scorpio couple. Virgo, being ruled by Mercury, is a conscientious individual who values order and perfection. On the other hand, the Mars-ruled Scorpio has a passion which blossoms in a Virgo and Scorpio love match. Both of these are also intellectually sound signs which is why they will enjoy their conversations but, it is also possible that they might end up in a loop where they point out each other's faults all the time.",
    "love-rating": "85%",
    "friendship": "We sincerely believe that Virgo and Scorpio friends can battle out every storm that comes their way. The reason behind our conviction is that these two signs share almost all the intrinsic qualities which are crucial for a successful friendship. Virgo is an earth sign who is attentive and likes to lend their ear when their loved ones need them. While Scorpio is a water sign who likes to explore and therefore bring new things to their friendship. Further, Virgo-Scorpio friendship thrives because they both seek a deep understanding in partnerships. Their mutual need for emotional security is what makes them extremely loyal to one another in the long run, making them very dependable. Virgo and Scorpio friendship compatibility is extremely strong because one offers pragmatism and the other devotion.",
    "friendship-rating": "88%"
  },
  {
    "signs": ["Virgo", "Sagittarius"],
    "love": "Order, meticulousness, perfection and deep analysis are the key characteristics that define a Virgo. On the other hand, free-spirited, exciting, fun and adventurous are the adjectives that can be associated with Sagittarius. Ruled by Mercury and Jupiter respectively, a Virgo and Sagittarius couple view life in contrasting manners. This makes Virgo and Sagittarius compatibility extremely difficult. Sagittarius might find Virgo's pragmatism too boring while Sagittarius bursts of excitement can become intolerable for Virgo. Further, Virgo tends to demand perfection from their couple which can become extremely annoying for the free-spirited Sagittarius, making Virgo-Sagittarius love somewhat impossible at times. When Virgo and Sagittarius love match occurs, the only thing that can help them is when they start to see the benefits of being together. Virgo can help Sagittarius land on their feet and not crash from their adventures while Sagittarius can add excitement to the mundane life of a Virgo.",
    "love-rating": "13%",
    "friendship": "Virgo and Sagittarius friends can be incredibly helpful to each other. Virgo, due to their perfectionist nature can involve themselves in numerous tasks. Sagittarius, due to their energetic nature can always lift Virgo's mood and offer a helping hand whenever they can. Whether or not Virgo can trust their work is another matter. Both these signs also have a strong sense of conviction, even though they differ in their approaches. This gives them solidity and their diverse personality brings dynamism which increases the Virgo and Sagittarius friendship compatibility. Virgo-Sagittarius friendship can be weak at times when Virgo tries to direct Sagittarius' actions too much. Sagittarius can be too assertive as well but what matters is how both of them react to each other's suggestions. If both of them can offer suggestions and also give them the freedom to accept or reject those, Virgo-Sagittarius friendship can last for a lifetime.",
    "friendship-rating": "57%"
  },
  {
    "signs": ["Virgo", "Capricorn"],
    "love": "Virgo and Capricorn love compatibility is one of the best in the entire zodiac. Both these signs are earth signs which increases their affinity towards each other by a considerable amount. A Virgo and Capricorn couple is the amalgamation of two extremely intelligent and conscientious individuals who are brilliant in their own ways. These two represent a steady and rational relationship that is envied by the people around them. Virgo and Capricorn love lives are incredibly success-oriented as well. Both these signs are known for their tenacity who never rests until they are done with their work. Virgo is ruled by the planet Mercury, this makes them extraordinarily immaculate in their work who strives for nothing but perfection. Mercury is also the god of messenger and therefore Virgos rarely have difficulties in communicating their feelings to their partners. Capricorn, on the other hand, is ruled by the planet Saturn which represents maturity and growth. When these two signs come together in a Virgo-Capricorn love match, they live their lives with pragmatism and vigour. The reason why Virgo and Capricorn compatibility is so good is primarily because Virgos can appreciate the intensity and dedication of the Capricorn while the latter adores the former's intuitive nature and attention to detail.",
    "love-rating": "83%",
    "friendship": "The Mercurian Virgo is known for its pragmatism and communication skills. Mercury, being the messenger god, blesses Virgo with all the resources it has in its hands. The goat Capricorn, on the other hand, is extremely diligent and meticulous in their work. This makes Virgo and Capricorn friendship compatibility incredibly good and beneficial for each other. In a Virgo-Capricorn friendship, Virgo brings virtuosity and offers realistic ideas while Capricorn takes charge of their work and pushes them to achieve their goals. They will bring discipline to their lives. Such symbiotic relationship and their ability to bring out the best versions of themselves is what makes Virgo and Capricorn friends extremely devoted. Virgos are also good at adaptability. Being a mutable sign, they can adjust themselves to most situations and with most people, especially if the other person is disciplined. Fortunately, Capricorn has a knack for discipline. They can also fit themselves into most relationships, friendly or romantic, given that they feel they have something to contribute to the relationship. Both signs are also perfectly capable of being patient and allowing the other person to take their time to adjust their thoughts during debates. In a Virgo-Capricorn friendship, Capricorns' conscientiousness allows them to be the initiator of projects while Virgo's meticulousness allows them to take over later.",
    "friendship-rating": "89%"
  },
  {
    "signs": ["Virgo", "Aquarius"],
    "love": "In a Virgo and Aquarius love match, their personalities can either crash or thrive due to the differences in perspectives that they hold in their lives. A Virgo and Aquarius couple can bring out the best versions of each other just as easily as they can bring out the worse. The elements associated with Virgo and Aquarius are earth and air respectively, which are somewhat conflicting in nature. Virgo has a rigid and pragmatic approach to life which is accentuated by their attention to detail. Perfectionism and discipline define a Virgo individual. On the other hand, Aquarius is a free-spirited, fun-loving sign who is just as driven towards success, as Virgo but, both of them have completely different approaches in finding it. Virgo likes to adhere to the conventional rules whereas Aquarius likes to find unique ways which define them. The Uranus-ruled Aquarius is a zealous sign who loves to do things for other people. For them, humanitarian acts are key to living a fulfilled life. The Mercury-ruled Virgo has a similar view, although they like to work for their loved ones rather than all people which can make a Virgo-Aquarius love match somewhat compatible. Aquarius tends to be erratic at times which is something that Virgo despises. On the flip side, Virgo's rigidity is unbearable to Aquarius effectively resulting in weak Virgo-Aquarius compatibility.",
    "love-rating": "36%",
    "friendship": "Virgo and Aquarius friends are connected by their rationality. This is the base for their trust as they find it baffling to not trust their partners. Virgo can find it difficult to trust people at the beginning however, with Aquarius, they'll quickly feel that they can be trusted without question. In a Virgo-Aquarius friendship, they might drift apart at times due to their personalities which are quite different, to begin with. To prevent this, they must put some effort into their friendship and accept each other for who they are. When it comes to Aquarius, they can be quite unreasonable, opinionated and obstinate at times. Both partners must remain passionate and intent towards achieving their goals. Virgo, on the other hand, can adapt to most social settings. Virgo and Aquarius friendship compatibility can be seen in the fact that Virgo doesn't mind helping out Aquarius, given that their efforts are properly recognized and appreciated. Conflicts among these friends rarely occur. Even if they do, Virgo's mutability quickly helps them to resolve these.",
    "friendship-rating": "40%"
  },
  {
    "signs": ["Virgo", "Pisces"],
    "love": "When it comes to Virgo and Pisces love compatibility, these two signs make a great couple. They usually enjoy a healthy relationship even though they are quite dissimilar from one another. Their dissimilarities, on the contrary, add to their relationship, creating an amazing balanced bond between them. What one lacks in quality, the other makes up for them, bringing the Virgo and Pisces compatibility up a notch. A Virgo and Pisces couple is usually an easy-going duo who loves to devote their time helping the people around them. They can be considered as a couple, people can look up to. In terms of Virgo and Pisces love, they both adore each other. They are a doting couple who attempts to bring harmony among themselves, as well as others. They are also sympathetic and accepting in nature. Virgos have the capability to help Pisces realize their dreams. They make a perfect match who can push each other to find success in their lives. While Virgo brings stability into their lives, Pisces will bring kindness. They both will increase their emotional depth and help each other in developing an uncomplicated perspective towards life. Even if their individual aspirations may differ, they can learn to synergize their thoughts and ideas to reach the summit of their careers as well.",
    "love-rating": "81%",
    "friendship": "These two signs are usually very compatible. When it comes to Virgo and Pisces friendship compatibility, they both complement each other's strengths and weaknesses almost flawlessly. Their elements, earth and water, are tangible, making their connection more evident. In a Virgo-Pisces friendship, Virgo brings stability and conviction while Pisces brings poetic romanticism, which helps them live with some excitement. Virgo brings structure and discipline while Pisces brings freedom and what feels like pure righteous bliss. Virgo and Pisces friends might occasionally face some difficulty in getting along. Both are mutable signs which makes them somewhat devoid of passion at times. This can make their friendship a little dull if they do not volunteer to rescue each other from boredom. Further, Pisces might be too flighty for Virgo and on the flip side, Virgo might be too rigid in Pisces' opinion. Nevertheless, both of them are perfectly capable of inspiring each other which is crucial in a friendship. They are also good at making compromises, the positive side of mutable signs, which enables them to quickly resolve any conflict brewing between Virgo-Pisces love matches or friends.",
    "friendship-rating": "79%"
  },
  {
    "signs": ["Libra", "Libra"],
    "love": "Libra is a cardinal air sign ruled by the planet Venus. This makes Libra and Libra love compatibility something to truly behold. Libra and Libra compatibility can be seen in the fact that they form one of the most understanding and agreeable relationships in the zodiac. Libra and Libra love matches are extremely well-balanced as well. They have a sense of harmony and aesthetics among them which they truly cherish and put effort into maintaining this harmony as well. Libra is a sign that is synonymous with partnership which is why when two Libras come together, magic happens. Libra, being a cardinal air sign, needs people to like them. This can pose some problems occasionally as they crave attention in even the direst of moments. This nature also dictates that they abhor conflict. When Libra-Libra love matches sense any conflict arising between the two, both of them try to immediately sort that out without wasting a moment. This makes Libra and Libra compatibility great. They understand what makes each other uncomfortable and seldom ask these things from their partners. They are sincere in their love as well. Another crucial element among Libra and Libra couples is that they are the happiest when they have someone to share their interests with. Since both of them have the same signs, they have at least some similar interests between them.",
    "love-rating": "80%",
    "friendship": "Being a cardinal sign, Libras possess the quality of trying out new things. Although they may lack initiativeness sometimes, they are always willing to discover and explore the unknown. They are also terrific motivators when it comes to their friendship, making Libra and Libra friendship compatibility quite strong. Libras are especially good at teamwork. They are ruled by Venus, after all. They also have a knack for intellectual conversations and keep an eye for good art. As friends, two Libras can spend hours appreciating a movie that they watched the night before. Libra and Libra friends have a good sense of judgement as well. In the zodiac, they are represented by the balancing scales, indicating how just they are in their judgements as well. Libra-Libra friendship enjoys diplomacy between them as well. These things make them incredible friends who share similar perspectives in similar fields of interest. In friendships and romance, they hold respect for each other and enjoy a blissful time with one another. They easily make one of the best friendships in the zodiac. The only thing that is of some concern is that they can spoil themselves to a fault.",
    "friendship-rating": "67%"
  },
  {
    "signs": ["Libra", "Scorpio"],
    "love": "Libra and Scorpio love compatibility can be seen in their emotional and satisfying union which marks a decent relationship. In a Libra-Scorpio relationship, the latter tends to brood over trivial things and get lost in their own emotions. This can turn out to be problematic for them if they wish to sustain a long relationship. It is a good thing that Libra has the conviction and personality which can pacify the tempestuous emotions of a Scorpio. While Libra helps Scorpio to get a hold of their emotions, the latter helps the other one out by offering their focus which is something Libras often lack. Libra and Scorpio love matches have the proclivity to balance each other out through Libra's need for connection and warmth and Scorpio's tendency to thrive on emotional intimacy. Both Libra and Scorpio are loyal signs which seldom do anything to hurt their partners. However, they can compromise their relationship through their differentiating perspectives on love and responsibilities. While Scorpio believes in being patient and wait for the right opportunity to show their fondness for their partners, Libra on the other hand likes to live in the moment. They will show their love for their partners whenever and wherever they feel like it. This difference can cause some tension between the two. Another hurdle that a Libra and Scorpio couple can come across is the difference in their values. Libras are free-spirits who does not like to be chained to anything or anybody, including their partners, so when Scorpios try to control them, things can quickly go awry.",
    "love-rating": "49%",
    "friendship": "Libra and Scorpio friends combine each other's intellect and emotions to make them stronger. They use their head and heart to get over the various hurdles that life throws at them. Libra-Scorpio friendship is however slightly more complicated than just head and heart. They are both ruled by planets with completely different traits associated with them. While one is more inclined towards emotional connection, the other gravitates more towards romanticism and aesthetics. This slightly decreases the Libra and Scorpio friendship compatibility as they often fail to find something common that they wish to talk about. For Libra, a Scorpio can be quite useful as they provide useful insights into the process of tackling a problem through their systematic approach. However, they can be equally annoying due to their outbursts of emotions which are challenging for a Libra to deal with. On the flip side, Libra can turn out to be quite provoking behind their free-spirited attitude. While the latter attribute helps bring excitement to a Scorpio's life, the former kills the moment as they are left flustered and stirred up. It is only through Libra's diplomacy that they can both get through their differences. Another problem for a Libra and Scorpio friendship is that Libra often brings up new things for them to enjoy together and move on to newer things almost immediately, leaving Scorpio alone as they have the habit of finishing what they started no matter what.",
    "friendship-rating": "66%"
  },
  {
    "signs": ["Libra", "Sagittarius"],
    "love": "When Libra and Sagittarius love match occurs, these signs find pure bliss. They embody a harmonious and deep connection which only gets stronger with time. Libra is a cardinal air sign and Sagittarius is a mutable fire sign. From this fact alone, it feels like Libra-Sagittarius love is extremely exciting and fun. Libra's air nature brings excitement to their relationship and Sagittarius' fire nature bring solidity and wisdom to it. Libra and Sagittarius love compatibility can be imagined as a strong wind blowing on a blazing fire. They make for a stimulating companionship that is strengthened by experience and exhilaration. A Libra and Sagittarius couple makes great lovers. Their relationship carries on their novelty long after the first date. What makes this relationship better is the understanding that they share with each other. Both of them are incredibly optimistic signs enabling them to live their lives with particular positivity and peace of mind. There might be some problems among them, although rarely. Libra is a sign which can be too emotionally controlling of their partners and Sagittarius, on the other hand, can be hurtful by speaking thoughtlessly against the sensitive Libra. However, they are forgiving individuals and quickly get over their problems increasing the Libra and Sagittarius compatibility quite a lot.",
    "love-rating": "91%",
    "friendship": "Libra is an air sign and Sagittarius is a fire sign. As we had mentioned earlier, air makes a fire stronger by spreading their flames and enabling them to grow exponentially. Just like fire and air, Libra-Sagittarius friendship is fierce and arduous. Their relationship/friendship is helmed by Libra but Sagittarius will rarely feel out of control. These two share an energetic bond between them which makes Libra and Sagittarius friendship compatibility extremely strong. If they have to, they can work for hours together, making it apparent that they are quite comfortable together. Both signs enjoy the space that they require and even though they help each other out in everything, they can hold up their own when things get rough. Libra, being a cardinal sign, is the initiator in this friendship, as they are always thinking of new ideas to carry out. The mutable sign, Sagittarius is flexible and can adapt to these ideas as they need. Libra and Sagittarius friends rarely complain when it comes to making plans. So what's the best aspect of a Libra-Sagittarius friendship, you ask? It's their shared appeal for cultivating knowledge and making use of their massive intellect.",
    "friendship-rating": "75%"
  },
  {
    "signs": ["Libra", "Capricorn"],
    "love": "Libra and Capricorn love matches occur to form a complicated relationship. They have the potential to make a fair decent couple but they need to put massive efforts into it for that to happen. Libra and Capricorn love compatibility can be considered as difficult. Both signs are quite different from each other in terms of their inherent traits. If they can figure out the interests that they share and develop a middle ground they can come back to, they can make this work. Libras have a knack for social relationships. Being around people makes them happy. Meeting new people and talking to them is something they find extremely interesting. On the other hand, Capricon is fairly quiet and inconspicuous and do not like to engage in too many conversations. They are most comfortable when they are alone. This opposing trait is a major problem in Libra-Capricorn love matches. Further, a Libra and Capricorn couple often fails to develop a proper tempo in their relationship. The cardinal sign, Libra is intrigued by beauty and art. It is concerned with the balance between relationships and life whereas Capricorn is more concerned about their work. For them, hard work and sincere efforts for their careers and to find recognition is the only reason to live for. This is what hinders Libra and Capricorn compatibility. Nevertheless, they can find a middle ground in all of this if they share love and respect among themselves.",
    "love-rating": "20%",
    "friendship": "The planets ruling these signs have very little in common making their Libra and Capricorn friendship a challenge. Working through their differences is crucial to develop a friendship and a relationship as well. Even though Libra has air as its element, it is encouraged by its ruling planet Venus, to take things slowly and take a moment to absorb the beauty of life. However, for the hard-working Capricorn, this can simply come off as laziness, ruining the chances of a friendship budding between them right at the outset. This makes Libra and Capricorn friendship compatibility extremely difficult. When Libra and Capricorn friends work together, they often require to develop a plan and appoint roles to each other. While the earth sign, Capricorn is a more ideal leader, Libra often tends to control their partners through emotional means. Therefore presetting roles is a must for them. Further, when it comes to their perspectives on various things of life, Libras tend to prefer a more intellectual approach. Capricorn, on the other hand, believes in hard work. For them, intellect is important, but only as a supplement to hard work and not the other way around. Libra-Capricorn friendship is therefore built on contrasting perspectives, making their foundation shaky, to say the least.",
    "friendship-rating": "29%"
  },
  {
    "signs": ["Libra", "Aquarius"],
    "love": "Libra and Aquarius love compatibility is one of the best in the zodiac. When these two come together, they uplift their souls and help each other out at every juncture of their lives. Both being air signs, they can connect on a much higher level than most other signs. Apart from that, Libra and Aquarius love matches share various interests such as their love for art and culture. They both enjoy conversations with new people and abhor restrictive influences. They are both energetic as well and their companies have the potential to sustain each other without exterior help, making Libra and Aquarius compatibility immensely strong. Libra-Aquarius love matches are always exciting not only to them but also to the people around them. They tend to light up any dull situation instantly with their wit. Further, these two signs are also extremely generous and kind. They always try to promote optimism and never fails to give back to society if they find success. A Libra and Aquarius couple loves people and more often than not, people love them. Libras are diplomatic by nature and bring this to the table in their relationships helping their partners sort out problems they might be stuck with. On the other hand, they also suffer from chronic indecisiveness and this is where the fixed sign Aquarius steps in and saves the day for their partners.",
    "love-rating": "85%",
    "friendship": "Libra is a cardinal sign and Aquarius is a fixed sign. While Libra often initiates things, they might find it difficult to complete these. When that happens, Aquarius's determination can come in handy. Libra and Aquarius friends can encourage each other for greatness by sharing their strengths and tackling their weaknesses together. Aquarius is a fixed air sign giving them the ability to be spontaneous and committed at the same time. What they chose to do is completely up to them. Libra, on the other hand, benefits immensely from this trait of Aquarius. On the other hand, Libra's convoluted means to settle things using diplomacy is something that Aquarius can use as they find themselves often breaking rules in public and private. The best part of a Libra-Aquarius friendship is that they can work together as a team. They have a great affinity towards each other and therefore find it easy to learn things together. They also share their love for socializing with people and exploring new projects. Apart from that, these two rarely argue and can make peace with any role they play in their joint projects. Neither sign finds their partner intimidating or unwise, rather, they both respect each other because they know each other's thoughts behind their works. Libra-Aquarius friends also share a lot of interests which allow them to always have something to do together.",
    "friendship-rating": "75%"
  },
  {
    "signs": ["Libra", "Pisces"],
    "love": "When it comes to Libra and Pisces love compatibility, these two signs form an amiable and tranquil relationship that has a decent amount of romance in it. These two signs are known for their love for new experiences. Novelty and excitement is something that they both can enjoy together. Libra is an air element sign which has a proclivity for justice and freedom. Pisces, on the other hand, are known for their ability to adapt to situations. This makes Libra and Pisces love matches attractive for many. A Libra and Pisces couple, however, may find it difficult to get along sometimes, not because they would argue, but because they would find themselves in situations where they have no idea what to do. Libra is a cardinal air sign and Pisces is a mutable water sign making them both somewhat without much conviction. Libra, even though do not have much conviction themselves and are often indecisiveness, will offer some solidity in their relationship. Pisces on the other hand will bring warmth and empathy to it bringing the Libra and Pisces compatibility up a notch.",
    "love-rating": "47%",
    "friendship": "Libra and Pisces are cardinal and mutable signs respectively. In a Libra-Pisces friendship, Libra takes the initiative and brings new ideas to the table. The latter analyses these projects or ideas and help Libra to make plans for the same. Both signs can get along pretty well and can turn out to be extremely useful for each other in their work. Libra and Pisces friendship compatibility is especially good because Libra are spontaneous and energetic and likes to do whatever they want while Pisces doesn't mind taking the backseat and enjoying the ride just as much as their partner. What's the best aspect of a Libra-Pisces relationship, you may ask? It's their mutual interest in working for society and the people around them. They also have a good synergy for an honest relationship. The bad thing about this friendship is that both signs are equally bad at making stern decisions. Libra's indecisiveness is apparent from their nature of jumping from one thing to another in search of excitement. They have a hard time sticking to things. Pisces has a similar problem in which they tend to follow the paths of their partners instead of deciding for themselves. This makes Libra-Pisces friendship, as well as Libra-Pisces love match somewhat frustrating for both of them.",
    "friendship-rating": "39%"
  },
  {
    "signs": ["Scorpio", "Scorpio"],
    "love": "When two Scorpions make a love match, it is a fierce tempest of intense passion. Both are obsessed with one another, and they move forward in love, sex and romance at an accelerated — some would say foolish — way. Personal relations are positively steamy but, to the equal and opposite extreme, disputes will also be frenetically powerful. Scorpios are a possessive pairing. Despite the unethical double life Scorpios sometimes live, they still take care of responsibilities. They go into the relationship with the best of intentions. If the spark fades, then they go outside the relationship for satisfaction. This couple will spend as much time as possible in the house they share. They prefer to keep the world outside. It lets them keep their secrets. It also lets them protect their relationship from outside interference. This closeness seems wonderful at the beginning of the relationship. But, the absence of autonomy promises resentment and boredom down the road.",
    "love-rating": "55%",
    "friendship": "The duo Scorpios are highly psychic signs and have great instincts about who can support them. That's why so many Scorpions have at least one fellow member of their sign in their social circle. Scorpio knows they can rely on this pal to alert them to trouble, offer truthful feedback, and affirm their feelings. Duo-Scorpio friendships are intense. Forensic by nature they appreciate each other's sharp focus - whether it's a school project or a business set-up - hours are spent fine-tuning and ensuring the end product is as near perfect as possible. Emotional creatures, there's a tendency to become possessive about the friendship Scorpio finds it hard to believe that anyone else could provide the same level of comfort and stimulation.",
    "friendship-rating": "73%"
  },
  {
    "signs": ["Scorpio", "Sagittarius"],
    "love": "If a Scorpio and a Sagittarius want to make a love match, they should be warned to slow down, take their time getting to know one another on a deep, significant level or else they run the risk of getting way ahead of themselves. This Scorpio Sagittarius relationship could be over before either partner even realizes it's started if they're not careful! Their patience will be very richly rewarded. Sagittarius thrives on change, on the new and the exciting and on the power of positive thought. Scorpio just wants to get closer and strengthen emotional ties. A Scorpio and Sagittarius connection bring two well-liked individuals together as a unit. When they are out on the town or enjoying adventures, they make friends with ease. Scorpio has a homebody preference though. It's something Sagittarius will need to adjust to because they're always on the go. Conscientious and trustworthy Sagittarius gives Scorpio a relationship platform of emotional security. A Sagittarius personality is compassionate and loving, so Scorpio falls in love with ease. Secretive and enigmatic Scorpio tantalizes Sagittarius with their curious nature. For Sagittarius, Scorpio is puzzling. Finding out what makes Scorpio tick is a challenge for Sagittarius to conquer!",
    "love-rating": "19%",
    "friendship": "Scorpio and Sagittarius friends duo are very different people who have lots to bring to each other. Driven Scorpio can show the Archer how to follow through on their dreams. The optimistic Archer will assist Scorpio in dispelling doubt. Naturally, resourceful Scorpio will disapprove of Sagittarius's irreverent attitude toward money. Initially, Sagittarius might avoid Scorpio - finding them too joyless and intense but both are intrigued by the human condition and like to push boundaries - eventually, curiosity draws them together and they form a mutual admiration society based on each other's intellect. Sagittarius loves playing with words usually to create comedy and Scorpio has the soul of a poet - they use words to sculpt beauty. As friends, love of language spills over into books, films and music. Sagittarius also uses Scorpios' forensic eye-for-detail to proofread Job applications and other written submissions. Scorpio learns to be more spontaneous thanks to Sag - although if it means taking a spur of the moment road trip they'll still formulate a mental to-do list.",
    "friendship-rating": "26%"
  },
  {
    "signs": ["Scorpio", "Capricorn"],
    "love": "When Scorpio and Capricorn make a love match, they get an opportunity to not only enjoy a loving relationship and learn the value of being a pair, but also to grow and mature as individuals. These two may be wary about sharing themselves with one another at first, and this emotional caution may dampen the initial impact of this relationship. Though they may be shy of getting involved and not the quickest to trust and share, these two Signs will discover that they can have quite a profound connection — one of friendship and deep loyalty. Capricorn is more conventional and conservative than liberal and venturesome Scorpio. They'll have to take a risk and step outside of the box once in a while to keep the relationship exciting. Scorpio is a homebody at heart, loving the private setting of the home. They'll have no problem spending downtime with Capricorn. It doesn't matter if it's to cuddle or to take care of household chores. Scorpio and Capricorn have a relationship that evolves from love to marriage. They both dream of having a family together with children they can raise. Capricorn remains the grounded and secure partner and parent. Scorpio has lofty visions and relies on Capricorn as an emotional anchor. As long as Capricorn remains affectionate and devoted, Scorpio does the same.",
    "love-rating": "33%",
    "friendship": "Scorpio and Capricorn duo have a healthy respect for each other. Perceptive Scorpio has a knack for spotting hidden opportunities. Ambitious Capricorn has a great work ethic. When they combine forces, incredible heights can be reached. At times, the Scorpion will be shocked by Capricorn's ability to be ruthless for the sake of advancement. As friends these two can morph into the Kings and Queens of taste and culture within their social group - something which could see them labelled as snobs if brand love gets out of hand. But, for the most part, Scorpio-Capricorn friendships are sturdy and solid - creatures of habit they'll attend sporting games together, revisit favourite restaurants and have each other's family over for dinner on a regular basis.",
    "friendship-rating": "87%"
  },
  {
    "signs": ["Scorpio", "Aquarius"],
    "love": "When Scorpio and Aquarius couple makes a love match, it is a fusion of two very different life philosophies and many very different needs. There is much chance for friction here. Where Scorpio faces their inner emotional world directly and with intense energy, thinking deeply about the more hidden undercurrents of life, Aquarius takes that same sort of energy and turns it outward. With their unusual, idealistic and, above all else, very social outlook on life, Aquarius seems an odd choice for the more introverted Scorpio. In the Aquarius and Scorpio relationship, they don't fall in love at the same time. Scorpio is the one who falls in love first. Then Scorpio is stuck waiting around for Aquarius to figure out what's going on at the time. Aquarius is slow to trust, even slower to love. Say the word commitment and watch Aquarius take off like a tumbleweed in a sandstorm.",
    "love-rating": "9%",
    "friendship": "Scorpio and Aquarius pair first come together thinking they will change one another. After they get to know each other, these signs realize that neither will budge. Scorpio's willpower is a force of nature, while Aquarius has convictions that are deeply rooted. Fortunately, this inability to be influenced is a source of admiration. Scorpio-Aquarius friendships are often born of necessity. Aquarius has an idea for a car that runs on distilled water but needs Scorpio to check the design blueprint. Scorpio needs mental health tweaking and uses Aquarius' psychological wisdom to let go of the past. When they discover a talent lacking in themselves, gratitude and friendship blossoms - they seize the opportunity to get projects and ideas realized. As friends, the Scorpio-Aquarius duo uses each other as sounding boards, seeking out relationship, career and lifestyle advice. They may start an online business or a charity together - Aquarius predicts the need for products or services and Scorpio creates the emotional buy-in through incisive marketing.",
    "friendship-rating": "56%"
  },
  {
    "signs": ["Scorpio", "Pisces"],
    "love": "When Scorpio and Pisces couple makes a love match, theirs is a splendid union of much respect and understanding. These mates share the same Element — Water — and thus have keen insight into one another's minds and hearts. Scorpio is very profound and covert, often caught up in their own secret plans, while Pisces is idealistic and looks for the nuances of a situation. However, Pisces also has a tendency to withdraw into their own mind and can forgive Scorpio for being mysterious or withdrawn at times. Pisces and Scorpio pairings become a deep and committed relationship quick. Scorpio won't have it any other way. But Pisces will have to remain true. Betraying a Scorpio is never a good thing. They take it harder than most others. Once the initial shock fades, the real hurting begins. Scorpio has a jealous streak a mile long. Betrayal fuels its fires. Ever hear the saying, “Vengeance is mine?” That's Scorpio talking the moment jealousy kicks in, and they find their partner has been in the arms of another.",
    "love-rating": "89%",
    "friendship": "These two Water Signs are terrific friends. Protective Scorpio loves caring for vulnerable Pisces. The whimsical Fish enjoys lifting Scorpio's spirits. They're highly creative people who love collaborating on writing, music, and design projects. When they're not working, they have fun trading books, watching movies and going to concerts together. These two Scorpio Pisces friends are intense souls who often form friendships within a fringe group - think Skater-punks and Metalheads. Scorpio, in particular, likes to look down on mere mortals and frightens people off with their menacing demeanour and sometimes, eyeliner and multiple piercings. Pisces is fashionably depressive enough for fringe dwelling but recognizes much of Scorpio's schtick is self-preservation - they soothe the scorpion beast with creativity and off-beat spirituality. Scorpio understands Pisces chaotic mind and teaches them how to focus on one idea before moving onto the next.",
    "friendship-rating": "84%"
  },
  {
    "signs": ["Sagittarius", "Sagittarius"],
    "love": "Sag and Sag love twins? Ahh! Yes and Definitely. Sagittarius and Sagittarius love compatibility is a blissful one. Both Sagittarian partners set an emotional statement for each other and put up a literal symbol of love and affection when together. They shall seek emotional peace around each other but might lose a bit when it comes to a passionate partnership. With a high tendency of being satisfied with each other on all sentimental aspects, Sagittarius and Sagittarius couple will be tremendous with each other with one of the supremest compatibilities among all the zodiacs. They would cope up with one another in the hardest of times and will be each other's back as well.",
    "love-rating": "89%",
    "friendship": "Sagittarius-Sagittarius friendship is a pretty compatible one. Both of them love adventure, exploring worlds, and have their own mutual desires to enjoy life. When they are together as friends, there is no means to stop them from getting along with each other and having a blasting time! However, they are considered loners because of their hard times making commitments with their partners, yet they might occasionally keep each other to some distance to avoid ego conflicts. Sagittarius and Sagittarius friendship compatibility holds genuine affection and tons of discussing topics and therefore sets a pretty suitable example for other zodiac friendship pairs. Thus, the two getting along is a philosophical exploration win for both of them.",
    "friendship-rating": "97%"
  },
  {
    "signs": ["Sagittarius", "Capricorn"],
    "love": "Sagittarius-Capricorn love isn't an effortless thing to happen. There shall be many polemics between them that aren't that easy to solve. Despite both being masters at chasing the real deals, the process is entirely different manners- more like “Same-same but different.” The salient keenness of crazy Capricorns irritates the Archer and makes them throw an unloving arrow in their brain. If there could be a synergy between Sagittarius and Capricorn couple, then there could be acknowledging cooperation. With this, they would also learn a lot about imbibing from each other. If we consider Sagittarius and Capricorn love compatibility, it's slow to begin one and involves too many opposing and thought conflicts.",
    "love-rating": "33%",
    "friendship": "Sagittarius and Capricorn friends have very little in mutual and shall struggle to stick around each other most of the time. They might have to put in a lot to keep things running around them and create balance in their friendship. To be exact, Sagittarius needs to take the help of their Capricorn mate when they lack the push to achieve goals. On flipping, Sagittarius must make their Capricorn friend learn the correct worth of enthusiasm and freedom. Sagittarius and Capricorn friendship compatibility could have a passionate team-making spirit as long as they keep their differences out of the picture. By putting in the maximum potential to their friendship, they both could become great inspiring personalities to each other.",
    "friendship-rating": "64%"
  },
  {
    "signs": ["Sagittarius", "Aquarius"],
    "love": "“Love without the fear of falling” is how Sagittarius-Aquarius love is. When they both get settled up in a love match, Sagittarius mate's braininess and Aquarius folk's ideals make up an adorable couple. The two share a partnership that couldn't be uninhibited. While it could become a competitive one, there's hardly a chance of feeling bored of each other in any manner. With being always “High on Life,” Sagittarius and Aquarius love compatibility is a perfect example of individuality, captivity, and creativeness. Sagittarius and Aquarius couple enjoy their lives with each other and always come up with enthusiasm to forward one another before themselves. With their habit of discussing everything with their other half, they effortlessly overcome all the bumps in their love journey with each other.",
    "love-rating": "88%",
    "friendship": "Sagittarius and Aquarius are friends in deeds, needs, and liveliness greed. With different interests yet similar ways of experiencing them, Sagittarius and Aquarius friendship compatibility is high. Though they live life very differently and stand on their own point of view, yet develop blissful and deep friendship bonds with each other. Accompanied by respecting each other's time and space, they also root up a feeling of admiration and mutual respect. Even though they are so compatible with each other, they might have some possibilities of not being friends forever. It is often the “I want to do it my way” nature of both the zodiacs that create a conflicting state between them.",
    "friendship-rating": "79%"
  },
  {
    "signs": ["Sagittarius", "Pisces"],
    "love": "Sagittarius-Pisces love isn't too difficult to crack because of their mutual viewpoint about a number of things. As a couple, they are big-picture believers and focus on giving their all-in when in a relationship. Therefore, Sagittarius and Pisces love compatibility is fueled with the right “Dream Come True” potential. That might lead to frustration and pushing situations between them. A Sagittarius and Pisces couple is creative, romantic, and cerebral as they both connect with each other on high-minds and philosophies that mostly only they understand and believe. Both of them might struggle in making commitments and possess a tendency to lean too much on each other. But, with a bit of push and understanding, they could get into an adorable relationship beyond their imaginations.",
    "love-rating": "73%",
    "friendship": "Sagittarius-Pisces friendship could be a good one even though their bond tends to be lumpy. Pisces is a generous and giving person who would go out of their usual paths to make scenarios okay. Meanwhile, their Sagittarius friend could find that commitment freaky and stands firm on making zero compromises. It never means that Sagittarius and Pisces friendship compatibility is weak. In all regards, it is a strong one as both stay happy with the way this set arrangement works. Over time, there are high chances that both understand that they are pretty different, but their intellectual connection can maintain the right amount of appreciation and attachment between each other.",
    "friendship-rating": "74%"
  },
  {
    "signs": ["Capricorn", "Capricorn"],
    "love": "Capricorn-Capricorn love could be pretty witless, and thus they got to be careful when handling romance. Both of them stress about their relationship with each other and are edgy, and demand prompting results. Therefore, they might take too much strain and lose their cool in the relationship. Capricorn-Capricorn compatibility could be good, but both need to learn to keep patience. Both Capricorns need to give each other space and time that is required to nurture this relationship. Moreover, they also need to believe in the phrase- Live and Let Live to make each other and themselves a better person.",
    "love-rating": "78%",
    "friendship": "Capricorn-Capricorn friendship could be an excellent one only when they settle on the same wavelength and viewpoint. With mutual emotions about the majority of things, they may find themselves completing each other's sentences. Capricorn and Capricorn friendship compatibility gives one of the most selective and fun-loving vibes. If two Goats come up together as friends, they would love to graze in the fields acknowledging every scene around. Despite so much mutuality, they might not necessarily have fun together. Because of the disliking and unspontaneous nature, they would lack being crazy Capricorn pals around each other. Moreover, energy-wise, Capricorns benefit from other zodiacs more than each other.",
    "friendship-rating": "75%"
  },
  {
    "signs": ["Capricorn", "Aquarius"],
    "love": "When a Goat and a Water-bearer bump into each other, they would have two different approaches to love, life, and relationship. So, Capricorn and Aquarius love compatibility could be an interesting one where both would be eager to discover new things and aspects from each other. There could be a number of things that would attract them close to one another, but still, their zodiacs won't just scream out Perfect Match Made! Moreover, if their ambitions come in between their love life, they wouldn't think second in choosing that over their partners. With practicality, emotions, and varying perceptions about romanticism and their other half, the Capricorn-Aquarius love could be a so-so one, pinched with some spices in the middle.",
    "love-rating": "55%",
    "friendship": "Capricorn and Aquarius friendship compatibility is pretty high. Both of them are the kind of people that go picky when selecting their BFFs and believe in investing in them thoroughly. If they closely get along with each other, they will share a shrewd bonding that would be liked by all around. With fun and excitement in their friendship, Capricorn and Aquarius friends share a lot in common. Both love to search for timeless things and believe in scorning fads. Where Aquarius shows its creativity, their Capricorn buddy just perceives it all right and calculatedly and right with them. Therefore, as pals, they could effortlessly get along, but only if none of them becomes critical or demotivating.",
    "friendship-rating": "75%"
  },
  {
    "signs": ["Capricorn", "Pisces"],
    "love": "With a union between potential Earth and majestic Water, Capricorn-Pisces love is an unlikely yet solid combination where both would analyze each other to extremes and make things work in a manner best for them. What Capricorn and Pisces love compatibility lacks is the manner they resolve matters with each other when issues and problems arise. Their fights are a sort of classic case. They both know how to be honest, kind, and dedicated towards each other and solve it all with their love and feelings. Capricorn and Pisces couple, therefore, knows how to break the walls of their other half in hard times and make them comfy in the best manner possible. In all, this shows the best angle of love possible among all zodiacs.",
    "love-rating": "89%",
    "friendship": "Capricorn-Pisces friendship could be an excellent one. The two cherish and accept each other for the person they are and create a safe and comfortable zone for one another where they can grow and flourish. With being generous and accepting towards one another, they don't demand a lot, which is why they have a healthy friendship. Also, Capricorn and Pisces friends complement each other wholly. On one side, the Capricorn loves making ideas turn into reality, while on the other side, their Pisces half becomes the mind behind those ideas. Despite the fact that both see the world from an entirely different perspective, Capricorn and Pisces friendship compatibility is pretty flexible and involves the right amount of understanding and implementation.",
    "friendship-rating": "88%"
  },
  {
    "signs": ["Aquarius", "Aquarius"],
    "love": "Aquarius and Aquarius love is a sweet-bitter one. By putting forward their positive aspects, they could acknowledge each other's best version and scale up to become a better person accordingly. But if they keep their pessimistic approaches ahead of them, the two would create a lot of pressure on themselves and each other. Aquarius and Aquarius love compatibility solely depends on the events they choose to bring in their day-to-day lives. Together the two would enjoy discussing progressiveness and modern thoughts but, individually, might run in a comparison race of “Mine Was Better.” Aquarius and Aquarius couple can make others jealous with the beautiful understanding they share and could never let people see through even if they are facing a hard time in their romantic lives.",
    "love-rating": "77%",
    "friendship": "Aquarius-Aquarius friendship is one of those excellent ones where both share the best times of their lives excluding others. Both Aquarians tend to be pretty self-contained and don't wish to explain themselves much to others as they believe people would hardly get their kind of braininess. But in their Aquarian pal, they find it all they are searching for to connect and share. Aquarius and Aquarius friendship compatibility is high and relies on the fact that they are equally spontaneous, rational, and practical about their ideas and thoughts. Both complement each other, share almost similar interests and actively choose each other for their happy times.",
    "friendship-rating": "69%"
  },
  {
    "signs": ["Aquarius", "Pisces"],
    "love": "As far as love is concerned, an Aquarius and Pisces couple is full of passion and creativity. Both of them are pretty impractical and like each other as individuals. If we peel out the layers of their relationship, Aquarius shall give away their desperation about their partner for self-freedom. On the other hand, Pisces wouldn't mind anything in making n number of sacrifices for their Aquarian half, if needed. When ending up together, Aquarius and Pisces love compatibility and can show passionate vibes. Sometimes they might run into conflicts, while, sometimes they shall enjoy each other's way of taking on life. But, the only way they could have this love relationship a long way run is when they admire each other rightfully and maintain a balance in their love life.",
    "love-rating": "57%",
    "friendship": "Aquarius-Pisces friendship works well despite all disagreements and conflicts. As long as they don't stay upset for too long from each other, their bond could be fulfilling and smooth. With all pleasant and intellectual bonding, Aquarius and Pisces friendship compatibility would be full of connections and sentimental satisfaction. If flipped the scene, the Aquarius would become annoyed when Pisces refuses to understand the facts. In return, Pisces would feel detached if their Aquarian half doesn't pay attention to their emotions. Aquarius and Pisces friends would only get along if they have any mutual interest that actually interests them. If situations go else-wise, the two don't stand a chance together in any manner.",
    "friendship-rating": "50%"
  },
  {
    "signs": ["Pisces", "Pisces"],
    "love": "Two over-emotional fellas getting along? Heck yeah! When two Pisces come up as a couple, they share efficient, honest, rich, and deep bonding with each other. They usually feel that their love is the best in the world and there couldn't be any more perfect love story than theirs. Both Pisces are equally committed to each other and always maintain an ideal relationship in majority arrays. Pisces and Pisces love compatibility is usually a swaying one as sometimes both can be too gullible, easy-going, and extremely sensitive about their sentiments. They are unable to set a line for themselves and go lost in their unrealistic optimism. But with flexibility and understanding the true meaning of love, Pisces-Pisces love could be a pleasant and blissful one.",
    "love-rating": "73%",
    "friendship": "Who wouldn't want a great listener and a genuine and caring friend? Pisces and Pisces friends are just the perfect example of this. They are always open to listening and understanding what the other has to say. But Pisces-Pisces friendship could sometimes be one-sided too. It might be because they always have something to give- be it advice or their care and fail to accept the manner things come back to them. Altogether if we see, Pisces and Pisces friendship compatibility is usually galvanizing as both move in a wagon of motivating each other and be true friends no matter what comes to them.",
    "friendship-rating": "74%"
  }
]
