[
  {
    "name": "Aries",
    "sun": "Your Sun is in Aries, meaning you are fundamentally assertive, and persistent, and courageous. Naturally competitive and fiercely independent, you push things forward with energy and enthusiasm and persevere through anything. You need to learn to understand other people as complex wholes.",
    "moon": "Your Moon is in Aries, meaning your emotional self is independent, energetic, and enthusiastic. You have a tendency to feel inadequate and overcompensate just because failure is a possibility.",
    "ascendant": "Your Ascendant is in Aries, meaning you come across as independent, energetic, and direct. You seem to move quickly, sometimes with the appearance of more haste and impulsiveness than thought, patience, or follow-through. Sometimes your forthrightness comes off as conceited or rude."
  },
  {
    "name": "Taurus",
    "sun": "Your Sun is in Taurus, meaning you are fundamentally stable, deliberate, and practical, though somewhat stubborn. Your sensual side takes comfort and pleasure very seriously—you appreciate nice things when they're useful and meaningful. People appreciate how reliable you are.",
    "moon": "Your Moon is in Taurus, meaning your emotional self is very romantic and sentimental. You are deeply loyal to the people you care about, and try hard to maintain security and stability within those relationships. You often feel powerless to fix messy situations, but your way of thinking through those things is sensible and practical.",
    "ascendant": "Your Ascendant is in Taurus, meaning you come across as highly attuned to practical and material matters, especially pleasure and hedonism. But that same materiality gives people the impression that you are reliable, settled, sensible, and deliberate, though sometimes stubborn."
  },
  {
    "name": "Gemini",
    "sun": "Your Sun is in Gemini, meaning you are fundamentally dynamic, quick-witted, eclectic, and curious. Fascinated by everything, your childlike energy is often scattered in a million directions. On a social level, this may come off as gossipy or flaky.",
    "moon": "Your Moon is in Gemini, meaning your emotional self is often restless and unsettled. You're extremely adaptable, which sometimes makes you feel pulled in too many directions. You are easily bored and need to feel like you are free to be creative and create meaning, which can make you feel like you're in a constant identity crisis.",
    "ascendant": "Your Ascendant is in Gemini, meaning you come across as quick-witted, chatty, eclectic, and fun, though somewhat inconsistent. In conversation, you seem probing and curious."
  },
  {
    "name": "Cancer",
    "sun": "Your Sun is in Cancer, meaning you are fundamentally sensitive, nurturing, and gentle. Your emotions may seem like a burden to you. You're deeply committed to your relationships and being good to the people you care about. You may have trouble with self-discipline.",
    "moon": "Your Moon is in Cancer, meaning your emotional self is sensitive, thoughtful, and empathetic. You have a tendency to feel like a martyr, and secretly fear being abandoned by those you love. You often have trouble letting things go and feel like an emotional wreck.",
    "ascendant": "Your Ascendant is in Cancer, meaning you come across as gentle, intuitive, and warm, though some may regard this as overly emotional or sensitive to criticism."
  },
  {
    "name": "Leo",
    "sun": "Your Sun is in Leo, meaning you are fundamentally bold and proud. You love attention and to be cared for. You pay it back in kind with your charm and your ability to make people feel better when they're blue. You know what your skills are and how to use them.",
    "moon": "Your Moon is in Leo, meaning your emotional self is dramatic, proud, expressive, idealistic, and somewhat self-centered. You need a lot of love, care, and validation from other people.",
    "ascendant": "Your Ascendant is in Leo, meaning you come across as bright, good-natured, and magnetic. Your energy makes you seem either like a know-it-all or a live wire—but always the center of attention."
  },
  {
    "name": "Virgo",
    "sun": "Your Sun is in Virgo, meaning you are particularly smart, responsible, hard-working, and self-sacrificing. You're thorough, meticulous, and intentional in everything you do—you can accomplish things that most people can't, but may also get bogged down by the details of your day-to-day. You have a need to be wholesome.",
    "moon": "Your Moon is in Virgo, meaning your emotional self is analytical, responsible, and pacifying. A bundle of nerves, you struggle with a need to be pure that may come out in self-sacrificing or nitpicky tendencies.",
    "ascendant": "Your Ascendant is in Virgo, meaning you come across as precise, diligent, peace-seeking, and organized. You may seem a bit too attached to work, details, and the pursuit of perfection, which sometimes makes you seem a bit boring."
  },
  {
    "name": "Libra",
    "sun": "Your Sun is in Libra, meaning you are fundamentally oriented towards fairness and justice. Your always-generous relativism allows you to see both sides of every situation, though this may sometimes come off as indecisive or insecure. You don't get tied down to a single view of things—you frequently question yourself and rethink your views; you're more impressionable than you appear. You do what you say and can get a lot done. Typically well-dressed.",
    "moon": "Your Moon is in Libra, meaning your emotional self is balanced, harmonious, sees both sides of every situation, indecisive, relationship-oriented, and desperate to please. You can be a little self-obsessed, but tend to hide your feelings and needs.",
    "ascendant": "Your Ascendant is in Libra, meaning you come across as compromising, courteous, and fair-minded, though sometimes passive aggressive. You seem inclined towards balance in all forms—aesthetic, romantic, and judgment."
  },
  {
    "name": "Scorpio",
    "sun": "Your Sun is in Scorpio, meaning you have a fundamental urge to get to the bottom of things, which can at times lead you to be manipulative or power-hungry, but it comes down to an intense passion for authenticity, real intimacy, and the truth.",
    "moon": "Your Moon is in Scorpio, meaning your emotional self is intense, passionate, and a bit dramatic. You have trouble opening up and letting other people in, and try to keep your intense darker emotions private. You find it difficult to trust others, which means your powers of perception may manifest in suspicion and controlling tendencies.",
    "ascendant": "Your Ascendant is in Scorpio, meaning you come across as passionate, incisive, cunning, strategic, and perceptive. Your intense and tenacious drive comes off as intimidating and powerful if not malicious or aggressive."
  },
  {
    "name": "Sagittarius",
    "sun": "Your Sun is in Sagittarius, meaning you are fundamentally curious, restless, and independent. You have strong, thought-through ideas about meaning and what's right or wrong. Interested in pushing the boundaries of the existent, you live to be free, and to learn. ",
    "moon": "Your Moon is in Sagittarius, meaning your emotional self is restless, self-questioning, optimistic, and independent. You may hide your sensitivities behind an interest in finding new ways to feel.",
    "ascendant": "Your Ascendant is in Sagittarius, meaning you come across as independent, optimistic, and confident, though sometimes overly blunt or critical. Generally a charming conversationalist, your free-spirited approach may come off as restless or easily bored."
  },
  {
    "name": "Capricorn",
    "sun": "Your Sun is in Capricorn, meaning you are fundamentally responsible, serious, efficient, and rational. This can lead to a power-hungry ambitiousness (you have a tendency for workaholism and success), or support for the dreams of those around you. Emotionally reserved, you need to learn to express your inner world and have fun.",
    "moon": "Your Moon is in Capricorn, meaning your emotional self is somewhat repressed in the name of responsibility, seriousness, and rationality. You crave the guidance and comfort of a teacher or parent.",
    "ascendant": "Your Ascendant is in Capricorn, meaning you come across as conservative, serious, and rational—perhaps even grave. You seem to make decisions in a responsible, practical, and prudent way. Your ambitions may come off as opportunistic."
  },
  {
    "name": "Aquarius",
    "sun": "Your Sun is in Aquarius, meaning you are fundamentally unconventional and anti. Comfortable dissenting or straying from the norm, your intellectual talent of abstraction is oriented towards pushing the boundaries of what seems reasonable. You carry a lot on your shoulders and have a need to fight for the underdog.",
    "moon": "Your Moon is in Aquarius, meaning your emotional self is intuitive, observant, detached, and rational. You are often in your own world, but are scared of how you truly feel.",
    "ascendant": "Your Ascendant is in Aquarius, meaning you come across as broadminded, intellectual, and prone to abstraction, though somewhat detached or abrupt in your dealings with the real world. Your unconventional interests may seem eccentric or pretentious to others."
  },
  {
    "name": "Pisces",
    "sun": "Your Sun is in Pisces, meaning you are fundamentally dreamy, insightful, and in your own world. You exist on a chaotic plane of the divine that is not at all material. Your rich imagination endows you with a strong intuition for hidden emotional currents. When you take offense it is deeply, and you aren't necessarily interested in reconciliation.",
    "moon": "Your Moon is in Pisces, meaning your emotional self is empathetic, dreamy, sensitive, and gentle. You feel vulnerable much of the time, and desperately wish for a partner who deeply understands you.",
    "ascendant": "Your Ascendant is in Pisces, meaning you come across as kind, dreamy, imaginative, and sensitive. Most of your actions seem subtle and non-aggressive, and you may sometimes come off as indecisive."
  }
]

